[Timeout] BlockStatement
src/api/collections/composer.js:5:38
 
 const { Op } = require("../../config");
 
-const canReadAllRecords = (model) => {
-    return {
-        readAllRecords: async () => {
-            try {
-                return await model.findAll({
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(`Server Error`);
-            }
-        }
-    };
-};
+const canReadAllRecords = (model) => {};
 const canReadAllRecordsWithCondition = (model) => {
     return {

[NoCoverage] BlockStatement
src/api/collections/composer.js:7:37
 
 const canReadAllRecords = (model) => {
     return {
-        readAllRecords: async () => {
-            try {
-                return await model.findAll({
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(`Server Error`);
-            }
-        }
+        readAllRecords: async () => {}
     };
 };

[NoCoverage] BlockStatement
src/api/collections/composer.js:8:17
 const canReadAllRecords = (model) => {
     return {
         readAllRecords: async () => {
-            try {
-                return await model.findAll({
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(`Server Error`);
             }

[NoCoverage] ObjectLiteral
src/api/collections/composer.js:10:33
         readAllRecords: async () => {
             try {
                 return await model.findAll({
-                    attributes: { exclude: ['password'] }
+                    attributes: {}
                 });
             } catch (e) {

[NoCoverage] BlockStatement
src/api/collections/composer.js:12:25
                 return await model.findAll({
                     attributes: { exclude: ['password'] }
                 });
-            } catch (e) {
-                throw new Error(`Server Error`);
-            }
+            } catch (e) {}
         }
     };

[Timeout] BlockStatement
src/api/collections/composer.js:18:51
         }
     };
 };
-const canReadAllRecordsWithCondition = (model) => {
-    return {
-        readAllRecordsWithCondition: async (condition) => {
-            try {
-                return await model.findAll({
-                    where: condition,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
-};
+const canReadAllRecordsWithCondition = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:19:12
     };
 };
 const canReadAllRecordsWithCondition = (model) => {
-    return {
-        readAllRecordsWithCondition: async (condition) => {
-            try {
-                return await model.findAll({
-                    where: condition,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:20:59
 };
 const canReadAllRecordsWithCondition = (model) => {
     return {
-        readAllRecordsWithCondition: async (condition) => {
-            try {
-                return await model.findAll({
-                    where: condition,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
+        readAllRecordsWithCondition: async (condition) => {}
     };
 };

[Timeout] BlockStatement
src/api/collections/composer.js:21:17
 const canReadAllRecordsWithCondition = (model) => {
     return {
         readAllRecordsWithCondition: async (condition) => {
-            try {
-                return await model.findAll({
-                    where: condition,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
             }

[NoCoverage] BlockStatement
src/api/collections/composer.js:26:25
                     where: condition,
                     attributes: { exclude: ['password'] }
                 });
-            } catch (e) {
-                throw new Error(e.message);
-            }
+            } catch (e) {}
         }
     };

[Killed] BlockStatement
src/api/collections/composer.js:35:42
 
 
 
-const canFindByEmailOrPhone = (model) => {
-    return {
-        findOneByEmailOrPhone: async (email, phone = 0) => {
-            try {
-                return await model.findOne({
-                    where: {
-                        [Op.or]: [
-                            { email },
-                            { phone }
-                        ]
-                    }
-                });
-            } catch (e) {
-                throw new Error(`Server Error`);
-            }
-        }
-    };
-};
+const canFindByEmailOrPhone = (model) => {};
 
 
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/api/collections/composer.js:37:60
 
 const canFindByEmailOrPhone = (model) => {
     return {
-        findOneByEmailOrPhone: async (email, phone = 0) => {
-            try {
-                return await model.findOne({
-                    where: {
-                        [Op.or]: [
-                            { email },
-                            { phone }
-                        ]
-                    }
-                });
-            } catch (e) {
-                throw new Error(`Server Error`);
-            }
-        }
+        findOneByEmailOrPhone: async (email, phone = 0) => {}
     };
 };
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/api/collections/composer.js:38:17
 const canFindByEmailOrPhone = (model) => {
     return {
         findOneByEmailOrPhone: async (email, phone = 0) => {
-            try {
-                return await model.findOne({
-                    where: {
-                        [Op.or]: [
-                            { email },
-                            { phone }
-                        ]
-                    }
-                });
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(`Server Error`);
             }
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] ObjectLiteral
src/api/collections/composer.js:40:28
         findOneByEmailOrPhone: async (email, phone = 0) => {
             try {
                 return await model.findOne({
-                    where: {
-                        [Op.or]: [
-                            { email },
-                            { phone }
-                        ]
-                    }
+                    where: {}
                 });
             } catch (e) {

[NoCoverage] BlockStatement
src/api/collections/composer.js:73:23
 const canPopulateOneRecordById = (model) => {
     return {
         populateById: async (condition, args) => {
-            if (args) {
-                const data = args.map((model) => {
-                    return {
-                        association: model,
-                        attributes: { exclude: ['password'] }
-                    };
-                });
-                try {
-                    return await model.findOne({
-                        where: condition,
-                        include: [...data]
-                    });
-                } catch (e) {
-                    throw new Error(e.message);
-                }
-            } else {
+            if (args) {} else {
                 try {
                     const result = await model.findOne({

[Timeout] ConditionalExpression
src/api/collections/composer.js:73:17
 const canPopulateOneRecordById = (model) => {
     return {
         populateById: async (condition, args) => {
-            if (args) {
+            if (true) {
                 const data = args.map((model) => {
                     return {

[NoCoverage] BlockStatement
src/api/collections/composer.js:74:50
     return {
         populateById: async (condition, args) => {
             if (args) {
-                const data = args.map((model) => {
-                    return {
-                        association: model,
-                        attributes: { exclude: ['password'] }
-                    };
-                });
+                const data = args.map((model) => {});
                 try {
                     return await model.findOne({

[NoCoverage] BlockStatement
src/api/collections/composer.js:80:21
                         attributes: { exclude: ['password'] }
                     };
                 });
-                try {
-                    return await model.findOne({
-                        where: condition,
-                        include: [...data]
-                    });
-                } catch (e) {
+                try {} catch (e) {
                     throw new Error(e.message);
                 }

[Timeout] BlockStatement
src/api/collections/composer.js:88:20
                 } catch (e) {
                     throw new Error(e.message);
                 }
-            } else {
-                try {
-                    const result = await model.findOne({
-                        where: condition,
-                        include: {
-                            all: true,
-                            // nested: true,
-                            attributes: { exclude: ['password'] }
-                        },
-                        attributes: { exclude: ['password'] }
-
-                    })
-                    return result;
-                } catch (e) {
-                    throw new Error(e.message);
-                }
-            }
+            } else {}
         }
     };

[Timeout] BlockStatement
src/api/collections/composer.js:89:21
                     throw new Error(e.message);
                 }
             } else {
-                try {
-                    const result = await model.findOne({
-                        where: condition,
-                        include: {
-                            all: true,
-                            // nested: true,
-                            attributes: { exclude: ['password'] }
-                        },
-                        attributes: { exclude: ['password'] }
-
-                    })
-                    return result;
-                } catch (e) {
+                try {} catch (e) {
                     throw new Error(e.message);
                 }

[Timeout] ObjectLiteral
src/api/collections/composer.js:92:34
                 try {
                     const result = await model.findOne({
                         where: condition,
-                        include: {
-                            all: true,
-                            // nested: true,
-                            attributes: { exclude: ['password'] }
-                        },
+                        include: {},
                         attributes: { exclude: ['password'] }
 

[Timeout] BooleanLiteral
src/api/collections/composer.js:93:34
                     const result = await model.findOne({
                         where: condition,
                         include: {
-                            all: true,
+                            all: false,
                             // nested: true,
                             attributes: { exclude: ['password'] }

[Timeout] ArrayDeclaration
src/api/collections/composer.js:97:48
                             // nested: true,
                             attributes: { exclude: ['password'] }
                         },
-                        attributes: { exclude: ['password'] }
+                        attributes: { exclude: [] }
 
                     })

[NoCoverage] BlockStatement
src/api/collections/composer.js:101:29
 
                     })
                     return result;
-                } catch (e) {
-                    throw new Error(e.message);
-                }
+                } catch (e) {}
             }
         }

[Timeout] BlockStatement
src/api/collections/composer.js:109:39
     };
 };
 
-const canCreateOneRecord = (model) => {
-    return {
-        create: async (data) => {
-            try {
-                return await model.create(data);
-            } catch (e) {
-                throw new Error(e.message);
-            };
-        }
-    };
-};
+const canCreateOneRecord = (model) => {};
 
 const canCreateInBulk = (model) => {

[Timeout] ObjectLiteral
src/api/collections/composer.js:110:12
 };
 
 const canCreateOneRecord = (model) => {
-    return {
-        create: async (data) => {
-            try {
-                return await model.create(data);
-            } catch (e) {
-                throw new Error(e.message);
-            };
-        }
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:111:33
 
 const canCreateOneRecord = (model) => {
     return {
-        create: async (data) => {
-            try {
-                return await model.create(data);
-            } catch (e) {
-                throw new Error(e.message);
-            };
-        }
+        create: async (data) => {}
     };
 };

[Timeout] BlockStatement
src/api/collections/composer.js:112:17
 const canCreateOneRecord = (model) => {
     return {
         create: async (data) => {
-            try {
-                return await model.create(data);
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
             };

[NoCoverage] BlockStatement
src/api/collections/composer.js:114:25
         create: async (data) => {
             try {
                 return await model.create(data);
-            } catch (e) {
-                throw new Error(e.message);
-            };
+            } catch (e) {};
         }
     };

[Timeout] BlockStatement
src/api/collections/composer.js:121:36
     };
 };
 
-const canCreateInBulk = (model) => {
-    return {
-        createInBulk: async (data) => {
-            try {
-                return await model.bulkCreate(data);
-            } catch (error) {
-                throw new Error(error.message);
-            }
-        }
-    };
-};
+const canCreateInBulk = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:122:12
 };
 
 const canCreateInBulk = (model) => {
-    return {
-        createInBulk: async (data) => {
-            try {
-                return await model.bulkCreate(data);
-            } catch (error) {
-                throw new Error(error.message);
-            }
-        }
-    };
+    return {};
 };
 

[NoCoverage] BlockStatement
src/api/collections/composer.js:123:39
 
 const canCreateInBulk = (model) => {
     return {
-        createInBulk: async (data) => {
-            try {
-                return await model.bulkCreate(data);
-            } catch (error) {
-                throw new Error(error.message);
-            }
-        }
+        createInBulk: async (data) => {}
     };
 };

[NoCoverage] BlockStatement
src/api/collections/composer.js:124:17
 const canCreateInBulk = (model) => {
     return {
         createInBulk: async (data) => {
-            try {
-                return await model.bulkCreate(data);
-            } catch (error) {
+            try {} catch (error) {
                 throw new Error(error.message);
             }

[NoCoverage] BlockStatement
src/api/collections/composer.js:126:29
         createInBulk: async (data) => {
             try {
                 return await model.bulkCreate(data);
-            } catch (error) {
-                throw new Error(error.message);
-            }
+            } catch (error) {}
         }
     };

[Timeout] BlockStatement
src/api/collections/composer.js:134:40
 };
 
 
-const canCreateWithNested = (model) => {
-    return {
-        createWithNested: async (data, children) => {
-            const associated = children.map((child) => {
-                return {
-                    association: child,
-
-                };
-            });
-            return await model.create(
-                data,
-                {
-                    include: [...associated],
-                }
-            );
-        }
-    };
-};
+const canCreateWithNested = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:135:12
 
 
 const canCreateWithNested = (model) => {
-    return {
-        createWithNested: async (data, children) => {
-            const associated = children.map((child) => {
-                return {
-                    association: child,
-
-                };
-            });
-            return await model.create(
-                data,
-                {
-                    include: [...associated],
-                }
-            );
-        }
-    };
+    return {};
 };
 

[NoCoverage] BlockStatement
src/api/collections/composer.js:136:53
 
 const canCreateWithNested = (model) => {
     return {
-        createWithNested: async (data, children) => {
-            const associated = children.map((child) => {
-                return {
-                    association: child,
-
-                };
-            });
-            return await model.create(
-                data,
-                {
-                    include: [...associated],
-                }
-            );
-        }
+        createWithNested: async (data, children) => {}
     };
 };

[NoCoverage] BlockStatement
src/api/collections/composer.js:137:56
 const canCreateWithNested = (model) => {
     return {
         createWithNested: async (data, children) => {
-            const associated = children.map((child) => {
-                return {
-                    association: child,
-
-                };
-            });
+            const associated = children.map((child) => {});
             return await model.create(
                 data,

[Timeout] BlockStatement
src/api/collections/composer.js:154:36
 };
 
 
-const canUpdateRecord = (model) => {
-    return {
-        update: async (id, data) => {
-            try {
-                return await model.update(data, {
-                    where: { id },
-                    returning: true,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
-};
+const canUpdateRecord = (model) => {};
 
 const canDestroyRecord = (model) => {

[Timeout] ObjectLiteral
src/api/collections/composer.js:155:12
 
 
 const canUpdateRecord = (model) => {
-    return {
-        update: async (id, data) => {
-            try {
-                return await model.update(data, {
-                    where: { id },
-                    returning: true,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
+    return {};
 };
 

[NoCoverage] BlockStatement
src/api/collections/composer.js:156:37
 
 const canUpdateRecord = (model) => {
     return {
-        update: async (id, data) => {
-            try {
-                return await model.update(data, {
-                    where: { id },
-                    returning: true,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
+        update: async (id, data) => {}
     };
 };

[NoCoverage] BlockStatement
src/api/collections/composer.js:157:17
 const canUpdateRecord = (model) => {
     return {
         update: async (id, data) => {
-            try {
-                return await model.update(data, {
-                    where: { id },
-                    returning: true,
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
             }

[NoCoverage] ObjectLiteral
src/api/collections/composer.js:158:49
     return {
         update: async (id, data) => {
             try {
-                return await model.update(data, {
-                    where: { id },
-                    returning: true,
-                    attributes: { exclude: ['password'] }
-                });
+                return await model.update(data, {});
             } catch (e) {
                 throw new Error(e.message);

[NoCoverage] BooleanLiteral
src/api/collections/composer.js:160:32
             try {
                 return await model.update(data, {
                     where: { id },
-                    returning: true,
+                    returning: false,
                     attributes: { exclude: ['password'] }
                 });

[NoCoverage] ArrayDeclaration
src/api/collections/composer.js:161:44
                 return await model.update(data, {
                     where: { id },
                     returning: true,
-                    attributes: { exclude: ['password'] }
+                    attributes: { exclude: [] }
                 });
             } catch (e) {

[NoCoverage] ObjectLiteral
src/api/collections/composer.js:161:33
                 return await model.update(data, {
                     where: { id },
                     returning: true,
-                    attributes: { exclude: ['password'] }
+                    attributes: {}
                 });
             } catch (e) {

[Timeout] BlockStatement
src/api/collections/composer.js:170:37
     };
 };
 
-const canDestroyRecord = (model) => {
-    return {
-        destroy: async (id) => {
-            try {
-                return await model.destroy({
-                    where: { id },
-                    returning: true
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
-};
+const canDestroyRecord = (model) => {};
 
 const canDestroyEventCatRecord = (model) => {

[Timeout] ObjectLiteral
src/api/collections/composer.js:171:12
 };
 
 const canDestroyRecord = (model) => {
-    return {
-        destroy: async (id) => {
-            try {
-                return await model.destroy({
-                    where: { id },
-                    returning: true
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:172:32
 
 const canDestroyRecord = (model) => {
     return {
-        destroy: async (id) => {
-            try {
-                return await model.destroy({
-                    where: { id },
-                    returning: true
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
+        destroy: async (id) => {}
     };
 };

[Timeout] BlockStatement
src/api/collections/composer.js:173:17
 const canDestroyRecord = (model) => {
     return {
         destroy: async (id) => {
-            try {
-                return await model.destroy({
-                    where: { id },
-                    returning: true
-                });
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
             }

[Timeout] BooleanLiteral
src/api/collections/composer.js:176:32
             try {
                 return await model.destroy({
                     where: { id },
-                    returning: true
+                    returning: false
                 });
             } catch (e) {

[Timeout] BlockStatement
src/api/collections/composer.js:185:45
     };
 };
 
-const canDestroyEventCatRecord = (model) => {
-    return {
-        destroyEventCat: async (id,categories) => {
-            try {
-                return await model.destroy({
-                    where: {
-                        [Op.and]: [
-                            { EventId:id },
-                            { CategoryId :categories}
-                        ]
-                    },
-                    returning: true
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
-};
+const canDestroyEventCatRecord = (model) => {};
 
 

[Timeout] BlockStatement
src/api/collections/composer.js:187:51
 
 const canDestroyEventCatRecord = (model) => {
     return {
-        destroyEventCat: async (id,categories) => {
-            try {
-                return await model.destroy({
-                    where: {
-                        [Op.and]: [
-                            { EventId:id },
-                            { CategoryId :categories}
-                        ]
-                    },
-                    returning: true
-                });
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
+        destroyEventCat: async (id,categories) => {}
     };
 };

[Timeout] BlockStatement
src/api/collections/composer.js:188:17
 const canDestroyEventCatRecord = (model) => {
     return {
         destroyEventCat: async (id,categories) => {
-            try {
-                return await model.destroy({
-                    where: {
-                        [Op.and]: [
-                            { EventId:id },
-                            { CategoryId :categories}
-                        ]
-                    },
-                    returning: true
-                });
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
             }

[Timeout] ObjectLiteral
src/api/collections/composer.js:190:28
         destroyEventCat: async (id,categories) => {
             try {
                 return await model.destroy({
-                    where: {
-                        [Op.and]: [
-                            { EventId:id },
-                            { CategoryId :categories}
-                        ]
-                    },
+                    where: {},
                     returning: true
                 });

[Timeout] BooleanLiteral
src/api/collections/composer.js:196:32
                             { CategoryId :categories}
                         ]
                     },
-                    returning: true
+                    returning: false
                 });
             } catch (e) {

[NoCoverage] ConditionalExpression
src/api/collections/composer.js:209:17
 const canReadPopulatedRecords = (model) => {
     return {
         readAllPopulated: async (args) => {
-            if (args) {
+            if (false) {
                 const data = args.map((model) => {
                     return {

[NoCoverage] ConditionalExpression
src/api/collections/composer.js:209:17
 const canReadPopulatedRecords = (model) => {
     return {
         readAllPopulated: async (args) => {
-            if (args) {
+            if (true) {
                 const data = args.map((model) => {
                     return {

[NoCoverage] ObjectLiteral
src/api/collections/composer.js:211:28
         readAllPopulated: async (args) => {
             if (args) {
                 const data = args.map((model) => {
-                    return {
-                        association: model,
-                        attributes: { exclude: ['password'] }
-                    };
+                    return {};
                 });
                 try {

[NoCoverage] StringLiteral
src/api/collections/composer.js:213:49
                 const data = args.map((model) => {
                     return {
                         association: model,
-                        attributes: { exclude: ['password'] }
+                        attributes: { exclude: [""] }
                     };
                 });

[NoCoverage] ArrayDeclaration
src/api/collections/composer.js:213:48
                 const data = args.map((model) => {
                     return {
                         association: model,
-                        attributes: { exclude: ['password'] }
+                        attributes: { exclude: [] }
                     };
                 });

[NoCoverage] BlockStatement
src/api/collections/composer.js:216:21
                         attributes: { exclude: ['password'] }
                     };
                 });
-                try {
-                    return await model.findAll({
-                        include: [...data],
-                    });
-                } catch (e) {
+                try {} catch (e) {
                     throw new Error(`Server Error`);
 

[NoCoverage] ArrayDeclaration
src/api/collections/composer.js:218:34
                 });
                 try {
                     return await model.findAll({
-                        include: [...data],
+                        include: [],
                     });
                 } catch (e) {

[NoCoverage] BlockStatement
src/api/collections/composer.js:220:29
                     return await model.findAll({
                         include: [...data],
                     });
-                } catch (e) {
-                    throw new Error(`Server Error`);
-
-                }
+                } catch (e) {}
             }
             try {
