[NoCoverage] BlockStatement
api/controllers/auth-controllers/HashPassword.js:5:42
 
 const { bcrypt } = require('../../../config/utils')
 
-const hashPassword = async (password) => {
-  return await bcrypt.hash(password, 12);
-}
+const hashPassword = async (password) => {}
 
 module.exports = {

[Timeout] ObjectLiteral
api/controllers/auth-controllers/HashPassword.js:9:18
   return await bcrypt.hash(password, 12);
 }
 
-module.exports = {
-  hashPassword,
-};
+module.exports = {};
