[Timeout] BlockStatement
api/controllers/auth-controllers/VerifyToken.js:6:38
 const { jwt } = require('../../../config/utils');
 const { ACCESS_TOKEN_SECRET, REFRESH_TOKEN_SECRET } = require('../../../config');
 
-const verifyAccessToken = (token) => {
-    let payload = jwt.verify(token, ACCESS_TOKEN_SECRET);
-    return payload;
-}
+const verifyAccessToken = (token) => {}
 const verifyRefreshToken = (token) => {
     let payload = jwt.verify(token, REFRESH_TOKEN_SECRET);

[NoCoverage] BlockStatement
api/controllers/auth-controllers/VerifyToken.js:10:39
     let payload = jwt.verify(token, ACCESS_TOKEN_SECRET);
     return payload;
 }
-const verifyRefreshToken = (token) => {
-    let payload = jwt.verify(token, REFRESH_TOKEN_SECRET);
-    return payload;
-}
+const verifyRefreshToken = (token) => {}
 
 
