[NoCoverage] BlockStatement
src/api/collections/composer.js:225:17
 
                 }
             }
-            try {
-
-                return await model.findAll({
-                    include: {
-                        all: true,
-                        // nested: true,
-                        attributes: { exclude: ['password'] }
-                    },
-                    attributes: { exclude: ['password'] }
-                });
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
 

[NoCoverage] StringLiteral
src/api/collections/composer.js:233:45
                         // nested: true,
                         attributes: { exclude: ['password'] }
                     },
-                    attributes: { exclude: ['password'] }
+                    attributes: { exclude: [""] }
                 });
             } catch (e) {

[NoCoverage] BlockStatement
src/api/collections/composer.js:235:25
                     },
                     attributes: { exclude: ['password'] }
                 });
-            } catch (e) {
-                throw new Error(e.message);
-
-            }
+            } catch (e) {}
         }
     };

[Timeout] BlockStatement
src/api/collections/composer.js:244:36
 };
 
 
-const canUpdateInBulk = (model) => {
-    return {
-        updateInBulk: async (data, fields) => {
-            try {
-                return model.bulkCreate(
-                    data,
-                    {
-                        updateOnDuplicate: fields,
-                    }
-
-                );
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
-};
+const canUpdateInBulk = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:245:12
 
 
 const canUpdateInBulk = (model) => {
-    return {
-        updateInBulk: async (data, fields) => {
-            try {
-                return model.bulkCreate(
-                    data,
-                    {
-                        updateOnDuplicate: fields,
-                    }
-
-                );
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
-    };
+    return {};
 };
 

[NoCoverage] BlockStatement
src/api/collections/composer.js:246:47
 
 const canUpdateInBulk = (model) => {
     return {
-        updateInBulk: async (data, fields) => {
-            try {
-                return model.bulkCreate(
-                    data,
-                    {
-                        updateOnDuplicate: fields,
-                    }
-
-                );
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        }
+        updateInBulk: async (data, fields) => {}
     };
 };

[NoCoverage] BlockStatement
src/api/collections/composer.js:247:17
 const canUpdateInBulk = (model) => {
     return {
         updateInBulk: async (data, fields) => {
-            try {
-                return model.bulkCreate(
-                    data,
-                    {
-                        updateOnDuplicate: fields,
-                    }
-
-                );
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
             }

[NoCoverage] BlockStatement
src/api/collections/composer.js:255:25
                     }
 
                 );
-            } catch (e) {
-                throw new Error(e.message);
-            }
+            } catch (e) {}
         }
     };

[Timeout] BlockStatement
src/api/collections/composer.js:263:38
 };
 
 
-const canIncrementValue = (model) => {
-    return {
-        incrementValue: async (id, data) => {
-            return await model.increment(
-                data,
-                {
-                    where: { id },
-                },
-            );
-        }
-    };
-};
+const canIncrementValue = (model) => {};
 
 const createGenericCollections = (model) => {

[Timeout] ObjectLiteral
src/api/collections/composer.js:264:12
 
 
 const canIncrementValue = (model) => {
-    return {
-        incrementValue: async (id, data) => {
-            return await model.increment(
-                data,
-                {
-                    where: { id },
-                },
-            );
-        }
-    };
+    return {};
 };
 

[NoCoverage] BlockStatement
src/api/collections/composer.js:265:45
 
 const canIncrementValue = (model) => {
     return {
-        incrementValue: async (id, data) => {
-            return await model.increment(
-                data,
-                {
-                    where: { id },
-                },
-            );
-        }
+        incrementValue: async (id, data) => {}
     };
 };

[Timeout] BlockStatement
src/api/collections/composer.js:276:45
     };
 };
 
-const createGenericCollections = (model) => {
-    return {
-        ...canReadAllRecords(model),
-        ...canUpdateRecord(model),
-        ...canDestroyRecord(model),
-        ...canReadPopulatedRecords(model),
-        ...canPopulateOneRecordById(model),
-        ...canCreateOneRecord(model),
-        ...canReadAllRecordsWithCondition(model),
-        ...canDestroyEventCatRecord(model)
-
-    };
-};
+const createGenericCollections = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:277:12
 };
 
 const createGenericCollections = (model) => {
-    return {
-        ...canReadAllRecords(model),
-        ...canUpdateRecord(model),
-        ...canDestroyRecord(model),
-        ...canReadPopulatedRecords(model),
-        ...canPopulateOneRecordById(model),
-        ...canCreateOneRecord(model),
-        ...canReadAllRecordsWithCondition(model),
-        ...canDestroyEventCatRecord(model)
-
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:291:44
 };
 
 
-const createTrackerCollection = (model) => {
-    return {
-        ...canCreateOneRecord(model),
-        ...canCreateInBulk(model),
-        ...canIncrementValue(model)
-    };
-};
+const createTrackerCollection = (model) => {};
 
 const createAuthCollection = (model) => {

[Timeout] ObjectLiteral
src/api/collections/composer.js:292:12
 
 
 const createTrackerCollection = (model) => {
-    return {
-        ...canCreateOneRecord(model),
-        ...canCreateInBulk(model),
-        ...canIncrementValue(model)
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:299:41
     };
 };
 
-const createAuthCollection = (model) => {
-    return {
-        ...canFindByEmailOrPhone(model),
-        // ...canFindByPhone(model)
-    };
-};
+const createAuthCollection = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:300:12
 };
 
 const createAuthCollection = (model) => {
-    return {
-        ...canFindByEmailOrPhone(model),
-        // ...canFindByPhone(model)
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:307:42
 };
 
 
-const createOrderCollection = (model) => {
-    return {
-        ...canCreateWithNested(model),
-        ...canReadAllRecords(model),
-        ...canUpdateRecord(model),
-        ...canDestroyRecord(model),
-        ...canReadPopulatedRecords(model),
-        ...canPopulateOneRecordById(model),
-        ...canCreateOneRecord(model)
-    };
-};
+const createOrderCollection = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:308:12
 
 
 const createOrderCollection = (model) => {
-    return {
-        ...canCreateWithNested(model),
-        ...canReadAllRecords(model),
-        ...canUpdateRecord(model),
-        ...canDestroyRecord(model),
-        ...canReadPopulatedRecords(model),
-        ...canPopulateOneRecordById(model),
-        ...canCreateOneRecord(model)
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:320:49
 };
 
 
-const createOrderDetailsCollection = (model) => {
-    return {
-        ...canCreateInBulk(model),
-    };
-};
+const createOrderDetailsCollection = (model) => {};
 
 const createSaleItemCollection = (model) => {

[Timeout] BlockStatement
src/api/collections/composer.js:326:45
     };
 };
 
-const createSaleItemCollection = (model) => {
-    return {
-        ...canReadAllRecords(model),
-        ...canPopulateOneRecordById(model),
-        ...canUpdateRecord(model),
-        ...canDestroyRecord(model),
-        ...canCreateOneRecord(model),
-        ...canIncrementValue(model)
-    };
-};
+const createSaleItemCollection = (model) => {};
 
 

[Timeout] ObjectLiteral
src/api/collections/composer.js:327:12
 };
 
 const createSaleItemCollection = (model) => {
-    return {
-        ...canReadAllRecords(model),
-        ...canPopulateOneRecordById(model),
-        ...canUpdateRecord(model),
-        ...canDestroyRecord(model),
-        ...canCreateOneRecord(model),
-        ...canIncrementValue(model)
-    };
+    return {};
 };
 

[Timeout] BlockStatement
src/api/collections/composer.js:338:42
 };
 
 
-const createEventCollection = (model) => {
-    return {
-        ...canCreateWithNested(model),
-        ...canCreateOneRecord(model),
-        ...canPopulateOneRecordById(model),
-        ...canReadAllRecordsWithCondition(model),
-        ...canDestroyEventCatRecord(model)
-    };
-};
+const createEventCollection = (model) => {};
 
 const createtestCollection = (model) => {

[Timeout] BlockStatement
src/api/collections/composer.js:348:41
     };
 };
 
-const createtestCollection = (model) => {
-    return {
-        ...canReadPopulatedRecords(model),
-        ...canReadAllRecords(model),
-        ...canCreateWithNested(model),
-        ...canCreateOneRecord(model),
-        ...canPopulateOneRecordById(model),
-        ...canReadAllRecordsWithCondition(model),
-        ...canDestroyRecord(model),
-        ...canUpdateInBulk(model),
-        ...canUpdateRecord(model)
-
-    };
-};
+const createtestCollection = (model) => {};
 
 const createCategoryCollection = (model) => {

[Timeout] BlockStatement
src/api/collections/composer.js:363:45
     };
 };
 
-const createCategoryCollection = (model) => {
-    return {
-        ...canCreateWithNested(model),
-        ...canCreateOneRecord(model),
-        ...canPopulateOneRecordById(model),
-        ...canReadAllRecordsWithCondition(model),
-        ...canReadPopulatedRecords(model),
-        ...canCreateInBulk(model),
-        ...canDestroyRecord(model),
-        ...canDestroyEventCatRecord(model)
-
-    };
-};
+const createCategoryCollection = (model) => {};
 
 
