[NoCoverage] BlockStatement
api/controllers/bussiness-logic/calculateTotalPrice.js:4:42
 'use strict'
 
 
-const calculateTotalPrice = (payload) => {
-    let total = 0
-    for (let item of payload) {
-        const itemTotalPrice = item.price * item.quantity
-        total += itemTotalPrice
-    }
-
-    return total
-}
+const calculateTotalPrice = (payload) => {}
 
 

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/calculateTotalPrice.js:6:31
 
 const calculateTotalPrice = (payload) => {
     let total = 0
-    for (let item of payload) {
-        const itemTotalPrice = item.price * item.quantity
-        total += itemTotalPrice
-    }
+    for (let item of payload) {}
 
     return total

[NoCoverage] ArithmeticOperator
api/controllers/bussiness-logic/calculateTotalPrice.js:7:32
 const calculateTotalPrice = (payload) => {
     let total = 0
     for (let item of payload) {
-        const itemTotalPrice = item.price * item.quantity
+        const itemTotalPrice = item.price / item.quantity
         total += itemTotalPrice
     }

[NoCoverage] AssignmentOperator
api/controllers/bussiness-logic/calculateTotalPrice.js:8:9
     let total = 0
     for (let item of payload) {
         const itemTotalPrice = item.price * item.quantity
-        total += itemTotalPrice
+        total -= itemTotalPrice
     }
 

[Timeout] ObjectLiteral
api/controllers/bussiness-logic/calculateTotalPrice.js:15:18
 }
 
 
-module.exports = {
-    calculateTotalPrice
-}
+module.exports = {}
