[NoCoverage] BlockStatement
api/controllers/auth-controllers/checkExistingUser.js:8:47
 
 
 
-const isUserExist = async (req, res, next) => {
-    try {
-        const { email, phone } = req.body
-        const emailExist = await isEmailOrPhoneUnique(email, phone)
-        if (emailExist) {
-            next()
-        } else {
-            throw new Error('Email or Phone Already Used')
-        }
-    } catch (e) {
-        next(new AppError(401, e.message))
-    }
-}
+const isUserExist = async (req, res, next) => {}
 
 module.exports = {

[NoCoverage] BlockStatement
api/controllers/auth-controllers/checkExistingUser.js:9:9
 
 
 const isUserExist = async (req, res, next) => {
-    try {
-        const { email, phone } = req.body
-        const emailExist = await isEmailOrPhoneUnique(email, phone)
-        if (emailExist) {
-            next()
-        } else {
-            throw new Error('Email or Phone Already Used')
-        }
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message))
     }

[NoCoverage] ConditionalExpression
api/controllers/auth-controllers/checkExistingUser.js:12:13
     try {
         const { email, phone } = req.body
         const emailExist = await isEmailOrPhoneUnique(email, phone)
-        if (emailExist) {
+        if (false) {
             next()
         } else {

[NoCoverage] BlockStatement
api/controllers/auth-controllers/checkExistingUser.js:12:25
     try {
         const { email, phone } = req.body
         const emailExist = await isEmailOrPhoneUnique(email, phone)
-        if (emailExist) {
-            next()
-        } else {
+        if (emailExist) {} else {
             throw new Error('Email or Phone Already Used')
         }

[NoCoverage] BlockStatement
api/controllers/auth-controllers/checkExistingUser.js:14:16
         const emailExist = await isEmailOrPhoneUnique(email, phone)
         if (emailExist) {
             next()
-        } else {
-            throw new Error('Email or Phone Already Used')
-        }
+        } else {}
     } catch (e) {
         next(new AppError(401, e.message))

[NoCoverage] BlockStatement
api/controllers/auth-controllers/checkExistingUser.js:17:17
         } else {
             throw new Error('Email or Phone Already Used')
         }
-    } catch (e) {
-        next(new AppError(401, e.message))
-    }
+    } catch (e) {}
 }
 
