[NoCoverage] BlockStatement
api/controllers/bussiness-logic/categoriesOperations.js:7:37
 
 
 
-const extractCategories = (data) => {
-    return data.categories.reduce((val, item) => {
-        if (item.id) {
-            // val.existingCategories.name.push(item.name);
-            val.existingCategories.id.push(item.id);
-
-        } else {
-            val.newCategories.push(item);
-        }
-        return val;
-    }, {
-        newCategories: [],
-        existingCategories: {
-            // name: [],
-            id: []
-        }
-    });
-};
+const extractCategories = (data) => {};
 
 

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/categoriesOperations.js:8:50
 
 
 const extractCategories = (data) => {
-    return data.categories.reduce((val, item) => {
-        if (item.id) {
-            // val.existingCategories.name.push(item.name);
-            val.existingCategories.id.push(item.id);
-
-        } else {
-            val.newCategories.push(item);
-        }
-        return val;
-    }, {
+    return data.categories.reduce((val, item) => {}, {
         newCategories: [],
         existingCategories: {

[NoCoverage] ConditionalExpression
api/controllers/bussiness-logic/categoriesOperations.js:9:13
 
 const extractCategories = (data) => {
     return data.categories.reduce((val, item) => {
-        if (item.id) {
+        if (false) {
             // val.existingCategories.name.push(item.name);
             val.existingCategories.id.push(item.id);

[NoCoverage] ConditionalExpression
api/controllers/bussiness-logic/categoriesOperations.js:9:13
 
 const extractCategories = (data) => {
     return data.categories.reduce((val, item) => {
-        if (item.id) {
+        if (true) {
             // val.existingCategories.name.push(item.name);
             val.existingCategories.id.push(item.id);

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/categoriesOperations.js:13:16
             // val.existingCategories.name.push(item.name);
             val.existingCategories.id.push(item.id);
 
-        } else {
-            val.newCategories.push(item);
-        }
+        } else {}
         return val;
     }, {

[NoCoverage] ObjectLiteral
api/controllers/bussiness-logic/categoriesOperations.js:19:29
         return val;
     }, {
         newCategories: [],
-        existingCategories: {
-            // name: [],
-            id: []
-        }
+        existingCategories: {}
     });
 };

[Killed] BlockStatement
api/controllers/bussiness-logic/categoriesOperations.js:28:43
 
 
 
-const creatcat = async (Event, newCat) => {
-    if (newCat) {
-        const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(newCat);
-        const addedCategories = await Event.addCategories(toBeAddedCategories)
-
-        return addedCategories
-    }
-}
+const creatcat = async (Event, newCat) => {}
 
 const creatEvent = async (Cat, newEvent) => {
killedBy: Events Routes should update an event's categorys 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
api/controllers/bussiness-logic/categoriesOperations.js:29:9
 
 
 const creatcat = async (Event, newCat) => {
-    if (newCat) {
+    if (false) {
         const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(newCat);
         const addedCategories = await Event.addCategories(toBeAddedCategories)
killedBy: Events Routes should update an event's categorys 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
api/controllers/bussiness-logic/categoriesOperations.js:29:17
 
 
 const creatcat = async (Event, newCat) => {
-    if (newCat) {
-        const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(newCat);
-        const addedCategories = await Event.addCategories(toBeAddedCategories)
-
-        return addedCategories
-    }
+    if (newCat) {}
 }
 
killedBy: Events Routes should update an event's categorys 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
api/controllers/bussiness-logic/categoriesOperations.js:37:45
     }
 }
 
-const creatEvent = async (Cat, newEvent) => {
-    if (newEvent) {
-        const toBeAddedEvent = await eventCollection.readAllRecordsWithCondition(newEvent);
-        const addedEvent = await Cat.addEvents(toBeAddedEvent)
-
-        return addedEvent
-    }
-}
+const creatEvent = async (Cat, newEvent) => {}
 module.exports = {
     extractCategories,
killedBy: Categories Routes should update an category's event 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
api/controllers/bussiness-logic/categoriesOperations.js:38:9
 }
 
 const creatEvent = async (Cat, newEvent) => {
-    if (newEvent) {
+    if (true) {
         const toBeAddedEvent = await eventCollection.readAllRecordsWithCondition(newEvent);
         const addedEvent = await Cat.addEvents(toBeAddedEvent)
killedBy: Categories Routes should update an category's event 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
api/controllers/bussiness-logic/categoriesOperations.js:38:9
 }
 
 const creatEvent = async (Cat, newEvent) => {
-    if (newEvent) {
+    if (false) {
         const toBeAddedEvent = await eventCollection.readAllRecordsWithCondition(newEvent);
         const addedEvent = await Cat.addEvents(toBeAddedEvent)
killedBy: Categories Routes should update an category's event 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')
