[Timeout] BlockStatement
api/controllers/auth-controllers/checkUserCreds.js:10:50
 const { omit } = require('./../../../config/utils')
 
 
-const checkUserCreds = async (req, res, next) => {
-    try {
-        const authHeader = req.headers.authorization
-        const [email, password] = decodeHeaders(authHeader)
-        const user = await isEmailExist(email)
-        const payload = user.password
-        const isAuthenticated = await comparePassword(password, payload)
-        if (isAuthenticated) {
-            req.body = omit(user.dataValues, ['password'])
-            next()
-        } else {
-            throw new Error('Email or Password are incorrect')
-        }
-    } catch (e) {
-        next(new AppError(500, 'Email or Password are incorrect'))
-    }
-}
+const checkUserCreds = async (req, res, next) => {}
 
 module.exports = { checkUserCreds }

[Timeout] BlockStatement
api/controllers/auth-controllers/checkUserCreds.js:11:9
 
 
 const checkUserCreds = async (req, res, next) => {
-    try {
-        const authHeader = req.headers.authorization
-        const [email, password] = decodeHeaders(authHeader)
-        const user = await isEmailExist(email)
-        const payload = user.password
-        const isAuthenticated = await comparePassword(password, payload)
-        if (isAuthenticated) {
-            req.body = omit(user.dataValues, ['password'])
-            next()
-        } else {
-            throw new Error('Email or Password are incorrect')
-        }
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, 'Email or Password are incorrect'))
     }

[Killed] ConditionalExpression
api/controllers/auth-controllers/checkUserCreds.js:17:13
         const user = await isEmailExist(email)
         const payload = user.password
         const isAuthenticated = await comparePassword(password, payload)
-        if (isAuthenticated) {
+        if (false) {
             req.body = omit(user.dataValues, ['password'])
             next()
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
api/controllers/auth-controllers/checkUserCreds.js:17:13
         const user = await isEmailExist(email)
         const payload = user.password
         const isAuthenticated = await comparePassword(password, payload)
-        if (isAuthenticated) {
+        if (true) {
             req.body = omit(user.dataValues, ['password'])
             next()
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] ArrayDeclaration
api/controllers/auth-controllers/checkUserCreds.js:18:46
         const payload = user.password
         const isAuthenticated = await comparePassword(password, payload)
         if (isAuthenticated) {
-            req.body = omit(user.dataValues, ['password'])
+            req.body = omit(user.dataValues, [])
             next()
         } else {

[NoCoverage] BlockStatement
api/controllers/auth-controllers/checkUserCreds.js:20:16
         if (isAuthenticated) {
             req.body = omit(user.dataValues, ['password'])
             next()
-        } else {
-            throw new Error('Email or Password are incorrect')
-        }
+        } else {}
     } catch (e) {
         next(new AppError(500, 'Email or Password are incorrect'))

[NoCoverage] StringLiteral
api/controllers/auth-controllers/checkUserCreds.js:21:29
             req.body = omit(user.dataValues, ['password'])
             next()
         } else {
-            throw new Error('Email or Password are incorrect')
+            throw new Error("")
         }
     } catch (e) {

[NoCoverage] BlockStatement
api/controllers/auth-controllers/checkUserCreds.js:23:17
         } else {
             throw new Error('Email or Password are incorrect')
         }
-    } catch (e) {
-        next(new AppError(500, 'Email or Password are incorrect'))
-    }
+    } catch (e) {}
 }
 
