[Timeout] BlockStatement
api/controllers/auth-controllers/isAuthorized.js:7:48
 
 
 
-const isAuthorized = async (req, res, next) => {
-    try {
-        const { userRole } = req.user
-        const loggedInUserId = req.user.userId
-        const ownerId = parseInt(req.body.UserId)
-        if (ownerId === loggedInUserId || userRole == 'admin') {
-            next()
-        } else {
-            throw new Error('Not Authorized')
-        }
-    } catch (e) {
-        next(new AppError(401, e.message))
-    }
-}
+const isAuthorized = async (req, res, next) => {}
 
 module.exports = {

[Timeout] BlockStatement
api/controllers/auth-controllers/isAuthorized.js:8:9
 
 
 const isAuthorized = async (req, res, next) => {
-    try {
-        const { userRole } = req.user
-        const loggedInUserId = req.user.userId
-        const ownerId = parseInt(req.body.UserId)
-        if (ownerId === loggedInUserId || userRole == 'admin') {
-            next()
-        } else {
-            throw new Error('Not Authorized')
-        }
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message))
     }

[Timeout] EqualityOperator
api/controllers/auth-controllers/isAuthorized.js:12:13
         const { userRole } = req.user
         const loggedInUserId = req.user.userId
         const ownerId = parseInt(req.body.UserId)
-        if (ownerId === loggedInUserId || userRole == 'admin') {
+        if (ownerId !== loggedInUserId || userRole == 'admin') {
             next()
         } else {

[Timeout] BlockStatement
api/controllers/auth-controllers/isAuthorized.js:12:64
         const { userRole } = req.user
         const loggedInUserId = req.user.userId
         const ownerId = parseInt(req.body.UserId)
-        if (ownerId === loggedInUserId || userRole == 'admin') {
-            next()
-        } else {
+        if (ownerId === loggedInUserId || userRole == 'admin') {} else {
             throw new Error('Not Authorized')
         }

[NoCoverage] BlockStatement
api/controllers/auth-controllers/isAuthorized.js:14:16
         const ownerId = parseInt(req.body.UserId)
         if (ownerId === loggedInUserId || userRole == 'admin') {
             next()
-        } else {
-            throw new Error('Not Authorized')
-        }
+        } else {}
     } catch (e) {
         next(new AppError(401, e.message))
