[NoCoverage] BlockStatement
api/controllers/bussiness-logic/extractSaleItems.js:6:35
 const { saleItemCollection } = require("../../../models")
 
 
-const extractSaleItem = (data) => {
-    return data.details.reduce((val, item) => {
-        if (item.SaleItemId) {
-            val.push({
-                quantity: item.quantity,
-                id: item.SaleItemId,
-            })
-        }
-        return val
-    }, [])
-}
+const extractSaleItem = (data) => {}
 
 

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/extractSaleItems.js:7:47
 
 
 const extractSaleItem = (data) => {
-    return data.details.reduce((val, item) => {
-        if (item.SaleItemId) {
-            val.push({
-                quantity: item.quantity,
-                id: item.SaleItemId,
-            })
-        }
-        return val
-    }, [])
+    return data.details.reduce((val, item) => {}, [])
 }
 

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/extractSaleItems.js:8:30
 
 const extractSaleItem = (data) => {
     return data.details.reduce((val, item) => {
-        if (item.SaleItemId) {
-            val.push({
-                quantity: item.quantity,
-                id: item.SaleItemId,
-            })
-        }
+        if (item.SaleItemId) {}
         return val
     }, [])

[NoCoverage] ConditionalExpression
api/controllers/bussiness-logic/extractSaleItems.js:8:13
 
 const extractSaleItem = (data) => {
     return data.details.reduce((val, item) => {
-        if (item.SaleItemId) {
+        if (true) {
             val.push({
                 quantity: item.quantity,

[NoCoverage] ObjectLiteral
api/controllers/bussiness-logic/extractSaleItems.js:9:22
 const extractSaleItem = (data) => {
     return data.details.reduce((val, item) => {
         if (item.SaleItemId) {
-            val.push({
-                quantity: item.quantity,
-                id: item.SaleItemId,
-            })
+            val.push({})
         }
         return val

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/extractSaleItems.js:20:53
 
 
 
-const updateSaleItemQuantity = async (saleItems) => {
-    const updatedItems = []
-    try {
-        for (let item of saleItems) {
-            const data = {
-                quantity: -item.quantity
-            }
-            const updatedSaleItemQuantity = await saleItemCollection.incrementValue(item.id, data)
-            updatedItems.push(updatedSaleItemQuantity[0][0][0])
-        }
-        return updatedItems
-    } catch (error) {
-        throw new Error
-    }
-}
+const updateSaleItemQuantity = async (saleItems) => {}
 
 

[NoCoverage] ArrayDeclaration
api/controllers/bussiness-logic/extractSaleItems.js:21:26
 
 
 const updateSaleItemQuantity = async (saleItems) => {
-    const updatedItems = []
+    const updatedItems = ["Stryker was here"]
     try {
         for (let item of saleItems) {

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/extractSaleItems.js:22:9
 
 const updateSaleItemQuantity = async (saleItems) => {
     const updatedItems = []
-    try {
-        for (let item of saleItems) {
-            const data = {
-                quantity: -item.quantity
-            }
-            const updatedSaleItemQuantity = await saleItemCollection.incrementValue(item.id, data)
-            updatedItems.push(updatedSaleItemQuantity[0][0][0])
-        }
-        return updatedItems
-    } catch (error) {
+    try {} catch (error) {
         throw new Error
     }

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/extractSaleItems.js:23:37
 const updateSaleItemQuantity = async (saleItems) => {
     const updatedItems = []
     try {
-        for (let item of saleItems) {
-            const data = {
-                quantity: -item.quantity
-            }
-            const updatedSaleItemQuantity = await saleItemCollection.incrementValue(item.id, data)
-            updatedItems.push(updatedSaleItemQuantity[0][0][0])
-        }
+        for (let item of saleItems) {}
         return updatedItems
     } catch (error) {

[NoCoverage] UnaryOperator
api/controllers/bussiness-logic/extractSaleItems.js:25:27
     try {
         for (let item of saleItems) {
             const data = {
-                quantity: -item.quantity
+                quantity: +item.quantity
             }
             const updatedSaleItemQuantity = await saleItemCollection.incrementValue(item.id, data)

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/extractSaleItems.js:31:21
             updatedItems.push(updatedSaleItemQuantity[0][0][0])
         }
         return updatedItems
-    } catch (error) {
-        throw new Error
-    }
+    } catch (error) {}
 }
 
