[Timeout] BlockStatement
api/controllers/auth-controllers/isEmailExist.js:8:39
 
 
 
-const isEmailExist = async (email) => {
-    const user = await authCollection.findOneByEmailOrPhone(email)
-    if (user) {
-        return user
-    } else {
-        throw new Error(`User doesn't exist`)
-    }
-}
+const isEmailExist = async (email) => {}
 
 const isEmailOrPhoneUnique = async (email, phone) => {

[Killed] ConditionalExpression
api/controllers/auth-controllers/isEmailExist.js:10:9
 
 const isEmailExist = async (email) => {
     const user = await authCollection.findOneByEmailOrPhone(email)
-    if (user) {
+    if (false) {
         return user
     } else {
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] BlockStatement
api/controllers/auth-controllers/isEmailExist.js:10:15
 
 const isEmailExist = async (email) => {
     const user = await authCollection.findOneByEmailOrPhone(email)
-    if (user) {
-        return user
-    } else {
+    if (user) {} else {
         throw new Error(`User doesn't exist`)
     }

[NoCoverage] BlockStatement
api/controllers/auth-controllers/isEmailExist.js:12:12
     const user = await authCollection.findOneByEmailOrPhone(email)
     if (user) {
         return user
-    } else {
-        throw new Error(`User doesn't exist`)
-    }
+    } else {}
 }
 

[NoCoverage] BlockStatement
api/controllers/auth-controllers/isEmailExist.js:17:54
     }
 }
 
-const isEmailOrPhoneUnique = async (email, phone) => {
-    const user = await authCollection.findOneByEmailOrPhone(email, phone)
-    if (!user) {
-        return true
-    } else {
-        throw new Error(`Email or Phone number already used`)
-    }
-}
+const isEmailOrPhoneUnique = async (email, phone) => {}
 
 

[NoCoverage] ConditionalExpression
api/controllers/auth-controllers/isEmailExist.js:19:9
 
 const isEmailOrPhoneUnique = async (email, phone) => {
     const user = await authCollection.findOneByEmailOrPhone(email, phone)
-    if (!user) {
+    if (false) {
         return true
     } else {

[NoCoverage] ConditionalExpression
api/controllers/auth-controllers/isEmailExist.js:19:9
 
 const isEmailOrPhoneUnique = async (email, phone) => {
     const user = await authCollection.findOneByEmailOrPhone(email, phone)
-    if (!user) {
+    if (true) {
         return true
     } else {

[NoCoverage] BooleanLiteral
api/controllers/auth-controllers/isEmailExist.js:20:16
 const isEmailOrPhoneUnique = async (email, phone) => {
     const user = await authCollection.findOneByEmailOrPhone(email, phone)
     if (!user) {
-        return true
+        return false
     } else {
         throw new Error(`Email or Phone number already used`)

[NoCoverage] BlockStatement
api/controllers/auth-controllers/isEmailExist.js:21:12
     const user = await authCollection.findOneByEmailOrPhone(email, phone)
     if (!user) {
         return true
-    } else {
-        throw new Error(`Email or Phone number already used`)
-    }
+    } else {}
 }
 

[NoCoverage] StringLiteral
api/controllers/auth-controllers/isEmailExist.js:22:25
     if (!user) {
         return true
     } else {
-        throw new Error(`Email or Phone number already used`)
+        throw new Error(``)
     }
 }
