[NoCoverage] BlockStatement
api/controllers/bussiness-logic/fillRentalTracker.js:7:46
 
 
 
-const createTrackersInBulk = async (data) => {
-    return await rentalTrackerCollection.createInBulk(data)
-}
+const createTrackersInBulk = async (data) => {}
 
 const updateRentalTrackerQuantity = async (rentalTrackers) => {

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/fillRentalTracker.js:11:63
     return await rentalTrackerCollection.createInBulk(data)
 }
 
-const updateRentalTrackerQuantity = async (rentalTrackers) => {
-    const updatedTrackers = []
-    try {
-        for (let item of rentalTrackers) {
-            const data = {
-                quantity: item.quantity
-            }
-            const updatedTrackerQuantity = await rentalTrackerCollection.incrementValue(item.id, data)
-            updatedTrackers.push(updatedTrackerQuantity[0][0][0])
-        }
-        return updatedTrackers
-    } catch (error) {
-        throw new Error(error.message)
-    }
-}
+const updateRentalTrackerQuantity = async (rentalTrackers) => {}
 
 

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/fillRentalTracker.js:13:9
 
 const updateRentalTrackerQuantity = async (rentalTrackers) => {
     const updatedTrackers = []
-    try {
-        for (let item of rentalTrackers) {
-            const data = {
-                quantity: item.quantity
-            }
-            const updatedTrackerQuantity = await rentalTrackerCollection.incrementValue(item.id, data)
-            updatedTrackers.push(updatedTrackerQuantity[0][0][0])
-        }
-        return updatedTrackers
-    } catch (error) {
+    try {} catch (error) {
         throw new Error(error.message)
     }

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/fillRentalTracker.js:14:42
 const updateRentalTrackerQuantity = async (rentalTrackers) => {
     const updatedTrackers = []
     try {
-        for (let item of rentalTrackers) {
-            const data = {
-                quantity: item.quantity
-            }
-            const updatedTrackerQuantity = await rentalTrackerCollection.incrementValue(item.id, data)
-            updatedTrackers.push(updatedTrackerQuantity[0][0][0])
-        }
+        for (let item of rentalTrackers) {}
         return updatedTrackers
     } catch (error) {

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/fillRentalTracker.js:22:21
             updatedTrackers.push(updatedTrackerQuantity[0][0][0])
         }
         return updatedTrackers
-    } catch (error) {
-        throw new Error(error.message)
-    }
+    } catch (error) {}
 }
 

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/fillRentalTracker.js:28:37
 }
 
 
-const extractRentalItem = (data) => {
-    return data.details.reduce((val, item) => {
-        if (item.RentalItemId && item.trackerId) {
-            val.existingTrackers.push({
-                quantity: item.quantity,
-                RentalItemId: item.RentalItemId,
-                date: data.deleveryDate,
-                id: item.trackerId
-            })
-        } else if (item.RentalItemId && !item.trackerId) {
-            val.newTrackers.push({
-                quantity: item.quantity,
-                RentalItemId: item.RentalItemId,
-                date: data.deleveryDate
-            })
-        }
-        return val
-    }, {
-        newTrackers: [],
-        existingTrackers: []
-    })
-}
+const extractRentalItem = (data) => {}
 
 

[NoCoverage] BlockStatement
api/controllers/bussiness-logic/fillRentalTracker.js:29:47
 
 
 const extractRentalItem = (data) => {
-    return data.details.reduce((val, item) => {
-        if (item.RentalItemId && item.trackerId) {
-            val.existingTrackers.push({
-                quantity: item.quantity,
-                RentalItemId: item.RentalItemId,
-                date: data.deleveryDate,
-                id: item.trackerId
-            })
-        } else if (item.RentalItemId && !item.trackerId) {
-            val.newTrackers.push({
-                quantity: item.quantity,
-                RentalItemId: item.RentalItemId,
-                date: data.deleveryDate
-            })
-        }
-        return val
-    }, {
+    return data.details.reduce((val, item) => {}, {
         newTrackers: [],
         existingTrackers: []

[NoCoverage] LogicalOperator
api/controllers/bussiness-logic/fillRentalTracker.js:30:13
 
 const extractRentalItem = (data) => {
     return data.details.reduce((val, item) => {
-        if (item.RentalItemId && item.trackerId) {
+        if (item.RentalItemId || item.trackerId) {
             val.existingTrackers.push({
                 quantity: item.quantity,

[NoCoverage] ConditionalExpression
api/controllers/bussiness-logic/fillRentalTracker.js:30:13
 
 const extractRentalItem = (data) => {
     return data.details.reduce((val, item) => {
-        if (item.RentalItemId && item.trackerId) {
+        if (false) {
             val.existingTrackers.push({
                 quantity: item.quantity,

[NoCoverage] BooleanLiteral
api/controllers/bussiness-logic/fillRentalTracker.js:37:41
                 date: data.deleveryDate,
                 id: item.trackerId
             })
-        } else if (item.RentalItemId && !item.trackerId) {
+        } else if (item.RentalItemId && item.trackerId) {
             val.newTrackers.push({
                 quantity: item.quantity,

[NoCoverage] ConditionalExpression
api/controllers/bussiness-logic/fillRentalTracker.js:37:20
                 date: data.deleveryDate,
                 id: item.trackerId
             })
-        } else if (item.RentalItemId && !item.trackerId) {
+        } else if (true) {
             val.newTrackers.push({
                 quantity: item.quantity,

[NoCoverage] ObjectLiteral
api/controllers/bussiness-logic/fillRentalTracker.js:38:34
                 id: item.trackerId
             })
         } else if (item.RentalItemId && !item.trackerId) {
-            val.newTrackers.push({
-                quantity: item.quantity,
-                RentalItemId: item.RentalItemId,
-                date: data.deleveryDate
-            })
+            val.newTrackers.push({})
         }
         return val

[NoCoverage] ArrayDeclaration
api/controllers/bussiness-logic/fillRentalTracker.js:46:22
         }
         return val
     }, {
-        newTrackers: [],
+        newTrackers: ["Stryker was here"],
         existingTrackers: []
     })
