[Timeout] BlockStatement
api/controllers/auth-controllers/isUserVerefied.js:9:44
 
 
 
-const isUserVerefied = (req, res, next) => {
-    try {
-        const token = req.body.accessToken
-        const isVerefied = verifyAccessToken(token)
-        if (isVerefied) {
-            req.user = isVerefied
-            next()
-        } else {
-            throw new Error('Not Authorized')
-        }
-    } catch (e) {
-        next(new AppError(401, e.message))
-    }
-}
+const isUserVerefied = (req, res, next) => {}
 
 

[Timeout] BlockStatement
api/controllers/auth-controllers/isUserVerefied.js:10:9
 
 
 const isUserVerefied = (req, res, next) => {
-    try {
-        const token = req.body.accessToken
-        const isVerefied = verifyAccessToken(token)
-        if (isVerefied) {
-            req.user = isVerefied
-            next()
-        } else {
-            throw new Error('Not Authorized')
-        }
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message))
     }

[Timeout] ConditionalExpression
api/controllers/auth-controllers/isUserVerefied.js:13:13
     try {
         const token = req.body.accessToken
         const isVerefied = verifyAccessToken(token)
-        if (isVerefied) {
+        if (false) {
             req.user = isVerefied
             next()

[Timeout] ConditionalExpression
api/controllers/auth-controllers/isUserVerefied.js:13:13
     try {
         const token = req.body.accessToken
         const isVerefied = verifyAccessToken(token)
-        if (isVerefied) {
+        if (true) {
             req.user = isVerefied
             next()
