[NoCoverage] BlockStatement
api/controllers/errorControllers/error-class.js:4:30
 'use strict'
 
 class AppError extends Error {
-    constructor(status, msg) {
-        super(),
-            this.status = status,
-            this.msg = msg
-    }
+    constructor(status, msg) {}
 }
 
