[Killed] BlockStatement
api/controllers/auth-controllers/DecodeHeaders.js:5:38
 
 const { base64 } = require("../../../config/utils");
 
-const decodeHeaders = (basicAuth) => {
-  const encoded = basicAuth.split(" ").pop();
-  const decoded = base64.decode(encoded).split(":");
-  return decoded;
-};
+const decodeHeaders = (basicAuth) => {};
 
 module.exports = {
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
