[NoCoverage] BlockStatement
api/controllers/errorControllers/error-handler.js:3:47
 'use strict';
 
-const errorHandler = (err, req, res, next) => {
-    const { status, msg } = err;
-    res.status(status).send(msg);
-};
+const errorHandler = (err, req, res, next) => {};
 
 module.exports = errorHandler;
