[NoCoverage] BlockStatement
api/controllers/errorControllers/pageNotFundHandler.js:5:49
 
 const AppError = require("./error-class")
 
-const pageNotFoundHandler = (req, res, next) => {
-    next(new AppError(404, 'Page Not Found'))
-}
+const pageNotFoundHandler = (req, res, next) => {}
 
 module.exports = pageNotFoundHandler

[NoCoverage] StringLiteral
api/controllers/errorControllers/pageNotFundHandler.js:6:28
 const AppError = require("./error-class")
 
 const pageNotFoundHandler = (req, res, next) => {
-    next(new AppError(404, 'Page Not Found'))
+    next(new AppError(404, ""))
 }
 
