[Timeout] BlockStatement
api/controllers/auth-controllers/TokenGenerator.js:7:42
 
 const { jwt } = require("../../../config/utils");
 
-const generateAccessToken = (payload) => {
-  return jwt.sign(payload, ACCESS_TOKEN_SECRET, { expiresIn: "10m" });
-
-
-};
+const generateAccessToken = (payload) => {};
 
 const generateRefreshToken = (payload) => {

[Timeout] ObjectLiteral
api/controllers/auth-controllers/TokenGenerator.js:8:49
 const { jwt } = require("../../../config/utils");
 
 const generateAccessToken = (payload) => {
-  return jwt.sign(payload, ACCESS_TOKEN_SECRET, { expiresIn: "10m" });
+  return jwt.sign(payload, ACCESS_TOKEN_SECRET, {});
 
 

[Timeout] StringLiteral
api/controllers/auth-controllers/TokenGenerator.js:8:62
 const { jwt } = require("../../../config/utils");
 
 const generateAccessToken = (payload) => {
-  return jwt.sign(payload, ACCESS_TOKEN_SECRET, { expiresIn: "10m" });
+  return jwt.sign(payload, ACCESS_TOKEN_SECRET, { expiresIn: "" });
 
 

[Timeout] BlockStatement
api/controllers/auth-controllers/TokenGenerator.js:13:43
 
 };
 
-const generateRefreshToken = (payload) => {
-  return jwt.sign(payload, REFRESH_TOKEN_SECRET, { expiresIn: "2h" });
-};
+const generateRefreshToken = (payload) => {};
 
 module.exports = {

[Timeout] ObjectLiteral
api/controllers/auth-controllers/TokenGenerator.js:14:50
 };
 
 const generateRefreshToken = (payload) => {
-  return jwt.sign(payload, REFRESH_TOKEN_SECRET, { expiresIn: "2h" });
+  return jwt.sign(payload, REFRESH_TOKEN_SECRET, {});
 };
 

[Killed] ObjectLiteral
api/controllers/auth-controllers/TokenGenerator.js:17:18
   return jwt.sign(payload, REFRESH_TOKEN_SECRET, { expiresIn: "2h" });
 };
 
-module.exports = {
-  generateAccessToken,
-  generateRefreshToken,
-};
+module.exports = {};
 
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
