[Killed] BlockStatement
api/controllers/auth-controllers/comparePassword.js:5:54
 const { bcrypt } = require('../../../config/utils');
 
 
-const comparePassword = async (password, payload) => {
-    return await bcrypt.compare(password, payload);
-}
+const comparePassword = async (password, payload) => {}
 
 module.exports = { comparePassword };
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
