[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:6:47
 const { orderCollection } = require("../../../models");
 const { AppError } = require("../../controllers/errorControllers");
 
-const createOrder = async (req, res, next) => {
-  try {
-    const newOrder = req.body;
-    const createdOrder = await orderCollection.create(newOrder);
-    res.status(201).json(createdOrder);
-  } catch (e) {
-    next(new AppError(401, "Cannot Create Order"));
-  }
-};
+const createOrder = async (req, res, next) => {};
 
 const deleteOrder = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:7:7
 const { AppError } = require("../../controllers/errorControllers");
 
 const createOrder = async (req, res, next) => {
-  try {
-    const newOrder = req.body;
-    const createdOrder = await orderCollection.create(newOrder);
-    res.status(201).json(createdOrder);
-  } catch (e) {
+  try {} catch (e) {
     next(new AppError(401, "Cannot Create Order"));
   }

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:11:15
     const newOrder = req.body;
     const createdOrder = await orderCollection.create(newOrder);
     res.status(201).json(createdOrder);
-  } catch (e) {
-    next(new AppError(401, "Cannot Create Order"));
-  }
+  } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:16:47
   }
 };
 
-const deleteOrder = async (req, res, next) => {
-  const id = req.params.id;
-  try {
-    const deletedOrder = await orderCollection.destroy(id);
-    res.status(204).json(deletedOrder);
-  } catch (e) {
-    next(new AppError(401, "Cannot Delete Order"));
-  }
-};
+const deleteOrder = async (req, res, next) => {};
 
 const updateOrder = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:18:7
 
 const deleteOrder = async (req, res, next) => {
   const id = req.params.id;
-  try {
-    const deletedOrder = await orderCollection.destroy(id);
-    res.status(204).json(deletedOrder);
-  } catch (e) {
+  try {} catch (e) {
     next(new AppError(401, "Cannot Delete Order"));
   }

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:21:15
   try {
     const deletedOrder = await orderCollection.destroy(id);
     res.status(204).json(deletedOrder);
-  } catch (e) {
-    next(new AppError(401, "Cannot Delete Order"));
-  }
+  } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:26:47
   }
 };
 
-const updateOrder = async (req, res, next) => {
-  const id = req.params.id;
-  try {
-    const updatedOrder = await orderCollection.update(id);
-    res.status(200).json(updatedOrder);
-  } catch (e) {
-    next(new AppError(401, "Cannot Delete Order"));
-  }
-};
+const updateOrder = async (req, res, next) => {};
 
 const getOrders = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:28:7
 
 const updateOrder = async (req, res, next) => {
   const id = req.params.id;
-  try {
-    const updatedOrder = await orderCollection.update(id);
-    res.status(200).json(updatedOrder);
-  } catch (e) {
+  try {} catch (e) {
     next(new AppError(401, "Cannot Delete Order"));
   }

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:31:15
   try {
     const updatedOrder = await orderCollection.update(id);
     res.status(200).json(updatedOrder);
-  } catch (e) {
-    next(new AppError(401, "Cannot Delete Order"));
-  }
+  } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:36:45
   }
 };
 
-const getOrders = async (req, res, next) => {
-  try {
-    const orders = await orderCollection.readAllRecords()
-    res.status(200).json(orders)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
-}
+const getOrders = async (req, res, next) => {}
 
 const getOrderDetails = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:37:7
 };
 
 const getOrders = async (req, res, next) => {
-  try {
-    const orders = await orderCollection.readAllRecords()
-    res.status(200).json(orders)
-  } catch (error) {
+  try {} catch (error) {
     next(new AppError(500, 'Server Error'))
   }

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:40:19
   try {
     const orders = await orderCollection.readAllRecords()
     res.status(200).json(orders)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:45:51
   }
 }
 
-const getOrderDetails = async (req, res, next) => {
-  try {
-    let filter = req.query.filter
-    if (typeof (filter) === 'string') {
-      filter = [filter]
-    }
-    const { id } = req.params
-    const order = await orderCollection.populateById(id, filter)
-    res.status(200).json(order)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
-}
+const getOrderDetails = async (req, res, next) => {}
 
 module.exports = {

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:46:7
 }
 
 const getOrderDetails = async (req, res, next) => {
-  try {
-    let filter = req.query.filter
-    if (typeof (filter) === 'string') {
-      filter = [filter]
-    }
-    const { id } = req.params
-    const order = await orderCollection.populateById(id, filter)
-    res.status(200).json(order)
-  } catch (error) {
+  try {} catch (error) {
     next(new AppError(500, 'Server Error'))
   }

[NoCoverage] EqualityOperator
api/routes/Order/order.handlers.js:48:9
 const getOrderDetails = async (req, res, next) => {
   try {
     let filter = req.query.filter
-    if (typeof (filter) === 'string') {
+    if (typeof filter !== 'string') {
       filter = [filter]
     }

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:48:39
 const getOrderDetails = async (req, res, next) => {
   try {
     let filter = req.query.filter
-    if (typeof (filter) === 'string') {
-      filter = [filter]
-    }
+    if (typeof (filter) === 'string') {}
     const { id } = req.params
     const order = await orderCollection.populateById(id, filter)

[NoCoverage] BlockStatement
api/routes/Order/order.handlers.js:54:19
     const { id } = req.params
     const order = await orderCollection.populateById(id, filter)
     res.status(200).json(order)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
+  } catch (error) {}
 }
 
