[NoCoverage] BlockStatement
api/routes/User/user.handlers.js:9:42
 
 const { readAllRecords } = userCollection
 
-const getter = async (req, res, next) => {
-    try {
-        const data = await readAllRecords()
-        res.status(200).send(data)
-    } catch (e) {
-        next(new AppError(500, e.message))
-    }
-}
+const getter = async (req, res, next) => {}
 
 module.exports = {

[NoCoverage] BlockStatement
api/routes/User/user.handlers.js:10:9
 const { readAllRecords } = userCollection
 
 const getter = async (req, res, next) => {
-    try {
-        const data = await readAllRecords()
-        res.status(200).send(data)
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, e.message))
     }

[NoCoverage] BlockStatement
api/routes/User/user.handlers.js:13:17
     try {
         const data = await readAllRecords()
         res.status(200).send(data)
-    } catch (e) {
-        next(new AppError(500, e.message))
-    }
+    } catch (e) {}
 }
 

[NoCoverage] ObjectLiteral
api/routes/User/user.handlers.js:18:18
     }
 }
 
-module.exports = {
-    getter
-}
+module.exports = {}
