[Timeout] BlockStatement
api/routes/User/userController.js:12:42
 
 
 
-const signin = async (req, res, next) => {
-    try {
-        const user = req.body
-        const payload = {
-            userId: user.id,
-            userRole: user.role
-        }
-        const token = generateAccessToken(payload)
-        const refresh_token = generateRefreshToken(payload)
-        user.accessToken = token
-        res.status(200)
-            .cookie('refresh_token', refresh_token, {
-                httpOnly: true,
-                secure: true,
-                sameSite: 'None',
-                maxAge: 2 * 60 * 60 * 1000
-            })
-            .json(user)
-    } catch (e) {
-        next(new AppError(401, 'Username or Password are incorrect'))
-    }
-}
+const signin = async (req, res, next) => {}
 
 

[Timeout] BlockStatement
api/routes/User/userController.js:13:9
 
 
 const signin = async (req, res, next) => {
-    try {
-        const user = req.body
-        const payload = {
-            userId: user.id,
-            userRole: user.role
-        }
-        const token = generateAccessToken(payload)
-        const refresh_token = generateRefreshToken(payload)
-        user.accessToken = token
-        res.status(200)
-            .cookie('refresh_token', refresh_token, {
-                httpOnly: true,
-                secure: true,
-                sameSite: 'None',
-                maxAge: 2 * 60 * 60 * 1000
-            })
-            .json(user)
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, 'Username or Password are incorrect'))
     }

[Timeout] BooleanLiteral
api/routes/User/userController.js:24:27
         user.accessToken = token
         res.status(200)
             .cookie('refresh_token', refresh_token, {
-                httpOnly: true,
+                httpOnly: false,
                 secure: true,
                 sameSite: 'None',

[Killed] BooleanLiteral
api/routes/User/userController.js:25:25
         res.status(200)
             .cookie('refresh_token', refresh_token, {
                 httpOnly: true,
-                secure: true,
+                secure: false,
                 sameSite: 'None',
                 maxAge: 2 * 60 * 60 * 1000
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ArithmeticOperator
api/routes/User/userController.js:27:25
                 httpOnly: true,
                 secure: true,
                 sameSite: 'None',
-                maxAge: 2 * 60 * 60 * 1000
+                maxAge: 2 / 60 * 60 * 1000
             })
             .json(user)
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] ArithmeticOperator
api/routes/User/userController.js:27:25
                 httpOnly: true,
                 secure: true,
                 sameSite: 'None',
-                maxAge: 2 * 60 * 60 * 1000
+                maxAge: 2 * 60 / 60 * 1000
             })
             .json(user)

[NoCoverage] BlockStatement
api/routes/User/userController.js:30:17
                 maxAge: 2 * 60 * 60 * 1000
             })
             .json(user)
-    } catch (e) {
-        next(new AppError(401, 'Username or Password are incorrect'))
-    }
+    } catch (e) {}
 }
 

[NoCoverage] BlockStatement
api/routes/User/userController.js:37:9
 
 
 const signup = async (req, res, next) => {
-    try {
-        const newUser = req.body
-        newUser.password = await hashPassword(req.body.password)
-        const createdUser = await userCollection.create(newUser)
-        const addedUser = omit(createdUser.dataValues, ['password'])
-        const payload = {
-            userId: addedUser.id,
-            userRole: addedUser.role
-        }
-        const token = generateAccessToken(payload)
-        const refresh_token = generateRefreshToken(payload)
-
-        addedUser.accessToken = token
-        res.status(201)
-            .cookie('refresh_token', refresh_token, {
-                httpOnly: true,
-                secure: true,
-                sameSite: 'None',
-                maxAge: 2 * 60 * 60 * 1000
-            })
-            .json(addedUser);
-
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, 'Cannot signup'))
     }

[NoCoverage] StringLiteral
api/routes/User/userController.js:41:57
         const newUser = req.body
         newUser.password = await hashPassword(req.body.password)
         const createdUser = await userCollection.create(newUser)
-        const addedUser = omit(createdUser.dataValues, ['password'])
+        const addedUser = omit(createdUser.dataValues, [""])
         const payload = {
             userId: addedUser.id,

[NoCoverage] StringLiteral
api/routes/User/userController.js:51:21
 
         addedUser.accessToken = token
         res.status(201)
-            .cookie('refresh_token', refresh_token, {
+            .cookie("", refresh_token, {
                 httpOnly: true,
                 secure: true,

[NoCoverage] BlockStatement
api/routes/User/userController.js:59:17
             })
             .json(addedUser);
 
-    } catch (e) {
-        next(new AppError(401, 'Cannot signup'))
-    }
+    } catch (e) {}
 }
 

[NoCoverage] BlockStatement
api/routes/User/userController.js:64:43
     }
 }
 
-const signout = async (req, res, next) => {
-    try {
-        res.clearCookie('refresh_token', {
-            httpOnly: true,
-            secure: true,
-            sameSite: 'None',
-            maxAge: 2 * 60 * 60 * 1000
-        }).sendStatus(204)
-    } catch (e) {
-        next(new AppError(401, 'Cannot signout'))
-    }
-}
+const signout = async (req, res, next) => {}
 
 module.exports = {

[NoCoverage] BlockStatement
api/routes/User/userController.js:65:9
 }
 
 const signout = async (req, res, next) => {
-    try {
-        res.clearCookie('refresh_token', {
-            httpOnly: true,
-            secure: true,
-            sameSite: 'None',
-            maxAge: 2 * 60 * 60 * 1000
-        }).sendStatus(204)
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, 'Cannot signout'))
     }

[NoCoverage] BooleanLiteral
api/routes/User/userController.js:67:23
 const signout = async (req, res, next) => {
     try {
         res.clearCookie('refresh_token', {
-            httpOnly: true,
+            httpOnly: false,
             secure: true,
             sameSite: 'None',

[NoCoverage] StringLiteral
api/routes/User/userController.js:69:23
         res.clearCookie('refresh_token', {
             httpOnly: true,
             secure: true,
-            sameSite: 'None',
+            sameSite: "",
             maxAge: 2 * 60 * 60 * 1000
         }).sendStatus(204)

[NoCoverage] BlockStatement
api/routes/User/userController.js:72:17
             sameSite: 'None',
             maxAge: 2 * 60 * 60 * 1000
         }).sendStatus(204)
-    } catch (e) {
-        next(new AppError(401, 'Cannot signout'))
-    }
+    } catch (e) {}
 }
 
