[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:8:54
 const AppError = require("../../controllers/errorControllers/error-class");
 
 
-const createCatWithEvent = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { events } = data;
-        const createdCategory = await categoryCollection.createWithNested(data, ['events']);
-        const result = {
-            events,
-            createdCategory
-        };
-        res.status(200).send(result);
-
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
-};
+const createCatWithEvent = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:9:9
 
 
 const createCatWithEvent = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { events } = data;
-        const createdCategory = await categoryCollection.createWithNested(data, ['events']);
-        const result = {
-            events,
-            createdCategory
-        };
-        res.status(200).send(result);
-
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, error.message));
     }

[NoCoverage] StringLiteral
api/routes/categories/categories.handlers.js:12:82
     try {
         const data = req.body;
         const { events } = data;
-        const createdCategory = await categoryCollection.createWithNested(data, ['events']);
+        const createdCategory = await categoryCollection.createWithNested(data, [""]);
         const result = {
             events,

[NoCoverage] ObjectLiteral
api/routes/categories/categories.handlers.js:13:24
         const data = req.body;
         const { events } = data;
         const createdCategory = await categoryCollection.createWithNested(data, ['events']);
-        const result = {
-            events,
-            createdCategory
-        };
+        const result = {};
         res.status(200).send(result);
 

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:19:21
         };
         res.status(200).send(result);
 
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:26:63
 
 
 
-const createEventAndAddCategories = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const newEvent = await eventCollection.create(data);
-        const { newCategories, existingCategories } = extractCategories(data);
-        const createdCategories = await categoryCollection.createInBulk(newCategories);
-        const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(existingCategories);
-        const completeEvent = await newEvent.addCategories([...createdCategories, ...toBeAddedCategories]);
-        const results = {
-            newCategories,
-            existingCategories,
-            createdCategories,
-            toBeAddedCategories,
-            completeEvent
-        };
-        res.status(200).send(results);
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
-};
+const createEventAndAddCategories = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:27:9
 
 
 const createEventAndAddCategories = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const newEvent = await eventCollection.create(data);
-        const { newCategories, existingCategories } = extractCategories(data);
-        const createdCategories = await categoryCollection.createInBulk(newCategories);
-        const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(existingCategories);
-        const completeEvent = await newEvent.addCategories([...createdCategories, ...toBeAddedCategories]);
-        const results = {
-            newCategories,
-            existingCategories,
-            createdCategories,
-            toBeAddedCategories,
-            completeEvent
-        };
-        res.status(200).send(results);
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, error.message));
     }

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:42:21
             completeEvent
         };
         res.status(200).send(results);
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:50:43
 
 
 
-const findAll = async (req, res, next) => {
-    const data = await categoryCollection.readAllPopulated();
-    res.status(200).send(data);
-};
+const findAll = async (req, res, next) => {};
 const updateExistingCatEvents = async (req, res, next) => {
     try {

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:54:59
     const data = await categoryCollection.readAllPopulated();
     res.status(200).send(data);
 };
-const updateExistingCatEvents = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { id } = req.params;
-        const { events } = data;
-        const data1 = { id };
-        const foundCategory = await categoryCollection.populateById(data1);
-        const data2 = events;
-        const foundEvents = await eventCollection.readAllRecordsWithCondition(data2);
-        const addedEvents = await foundCategory.addEvents(foundEvents);
-        const result = {
-            events,
-            foundCategory,
-            foundEvents,
-            addedEvents
-        };
-        res.status(200).send(result);
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
-};
+const updateExistingCatEvents = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:55:9
     res.status(200).send(data);
 };
 const updateExistingCatEvents = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { id } = req.params;
-        const { events } = data;
-        const data1 = { id };
-        const foundCategory = await categoryCollection.populateById(data1);
-        const data2 = events;
-        const foundEvents = await eventCollection.readAllRecordsWithCondition(data2);
-        const addedEvents = await foundCategory.addEvents(foundEvents);
-        const result = {
-            events,
-            foundCategory,
-            foundEvents,
-            addedEvents
-        };
-        res.status(200).send(result);
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, error.message));
     }

[NoCoverage] ObjectLiteral
api/routes/categories/categories.handlers.js:59:23
         const data = req.body;
         const { id } = req.params;
         const { events } = data;
-        const data1 = { id };
+        const data1 = {};
         const foundCategory = await categoryCollection.populateById(data1);
         const data2 = events;

[NoCoverage] BlockStatement
api/routes/categories/categories.handlers.js:71:21
             addedEvents
         };
         res.status(200).send(result);
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
+    } catch (error) {}
 };
 
