[Timeout] BlockStatement
api/routes/eventcattest/testCathandler.js:7:45
 const { extractCategories, creatcat, creatEvent } = require('../../controllers/bussiness-logic/categoriesOperations');
 const { AppError } = require('../../controllers/errorControllers');
 
-const createCat = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const newCategory = { "name": data.name };
-        const result = await sequelize.transaction(async () => {
-            try {
-                const createdCategory = await categoryCollection.create(newCategory);
-                const results = { createdCategory };
-                if (data.events) {
-                    results.toBeAddedEvents = await eventCollection.readAllRecordsWithCondition(data.events);
-                    results.completeCategory = await createdCategory.addEvents(results.toBeAddedEvents);
-                }
-                return results;
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        });
-
-        res.status(200).send(result);
-    } catch (e) {
-
-        next(new AppError(401, e.message));
-    }
-};
+const createCat = async (req, res, next) => {};
 
 const getCategory = async (req, res, next) => {

[Timeout] BlockStatement
api/routes/eventcattest/testCathandler.js:8:9
 const { AppError } = require('../../controllers/errorControllers');
 
 const createCat = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const newCategory = { "name": data.name };
-        const result = await sequelize.transaction(async () => {
-            try {
-                const createdCategory = await categoryCollection.create(newCategory);
-                const results = { createdCategory };
-                if (data.events) {
-                    results.toBeAddedEvents = await eventCollection.readAllRecordsWithCondition(data.events);
-                    results.completeCategory = await createdCategory.addEvents(results.toBeAddedEvents);
-                }
-                return results;
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        });
-
-        res.status(200).send(result);
-    } catch (e) {
+    try {} catch (e) {
 
         next(new AppError(401, e.message));

[Killed] BlockStatement
api/routes/eventcattest/testCathandler.js:11:64
     try {
         const data = req.body;
         const newCategory = { "name": data.name };
-        const result = await sequelize.transaction(async () => {
-            try {
-                const createdCategory = await categoryCollection.create(newCategory);
-                const results = { createdCategory };
-                if (data.events) {
-                    results.toBeAddedEvents = await eventCollection.readAllRecordsWithCondition(data.events);
-                    results.completeCategory = await createdCategory.addEvents(results.toBeAddedEvents);
-                }
-                return results;
-            } catch (e) {
-                throw new Error(e.message);
-            }
-        });
+        const result = await sequelize.transaction(async () => {});
 
         res.status(200).send(result);
killedBy: Categories Routes should create and delete an category 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
api/routes/eventcattest/testCathandler.js:12:17
         const data = req.body;
         const newCategory = { "name": data.name };
         const result = await sequelize.transaction(async () => {
-            try {
-                const createdCategory = await categoryCollection.create(newCategory);
-                const results = { createdCategory };
-                if (data.events) {
-                    results.toBeAddedEvents = await eventCollection.readAllRecordsWithCondition(data.events);
-                    results.completeCategory = await createdCategory.addEvents(results.toBeAddedEvents);
-                }
-                return results;
-            } catch (e) {
+            try {} catch (e) {
                 throw new Error(e.message);
             }
killedBy: Categories Routes should create and delete an category 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ObjectLiteral
api/routes/eventcattest/testCathandler.js:14:33
         const result = await sequelize.transaction(async () => {
             try {
                 const createdCategory = await categoryCollection.create(newCategory);
-                const results = { createdCategory };
+                const results = {};
                 if (data.events) {
                     results.toBeAddedEvents = await eventCollection.readAllRecordsWithCondition(data.events);
killedBy: Categories Routes should create and delete an category 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
api/routes/eventcattest/testCathandler.js:15:21
             try {
                 const createdCategory = await categoryCollection.create(newCategory);
                 const results = { createdCategory };
-                if (data.events) {
+                if (true) {
                     results.toBeAddedEvents = await eventCollection.readAllRecordsWithCondition(data.events);
                     results.completeCategory = await createdCategory.addEvents(results.toBeAddedEvents);
killedBy: Categories Routes should create and delete an category 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
api/routes/eventcattest/testCathandler.js:15:21
             try {
                 const createdCategory = await categoryCollection.create(newCategory);
                 const results = { createdCategory };
-                if (data.events) {
+                if (false) {
                     results.toBeAddedEvents = await eventCollection.readAllRecordsWithCondition(data.events);
                     results.completeCategory = await createdCategory.addEvents(results.toBeAddedEvents);
killedBy: Categories Routes should create and delete an category 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:20:25
                     results.completeCategory = await createdCategory.addEvents(results.toBeAddedEvents);
                 }
                 return results;
-            } catch (e) {
-                throw new Error(e.message);
-            }
+            } catch (e) {}
         });
 

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:26:17
         });
 
         res.status(200).send(result);
-    } catch (e) {
-
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:32:47
     }
 };
 
-const getCategory = async (req, res, next) => {
-    try {
-        const categoriesData = await categoryCollection.readAllPopulated();
-        res.status(200).json(categoriesData);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
-};
+const getCategory = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:33:9
 };
 
 const getCategory = async (req, res, next) => {
-    try {
-        const categoriesData = await categoryCollection.readAllPopulated();
-        res.status(200).json(categoriesData);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, e.message));
     }

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:36:17
     try {
         const categoriesData = await categoryCollection.readAllPopulated();
         res.status(200).json(categoriesData);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
+    } catch (e) {}
 };
 

[Killed] BlockStatement
api/routes/eventcattest/testCathandler.js:42:54
 };
 
 
-const getCategoryDetalis = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-        const categoryDetails = await categoryCollection.populateById({ id });
-        res.status(200).json(categoryDetails);
-    } catch (error) {
-        next(new AppError(500, 'Server Error'));
-    }
-};
+const getCategoryDetalis = async (req, res, next) => {};
 
 
killedBy: Categories Routes should get an Category 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
api/routes/eventcattest/testCathandler.js:43:9
 
 
 const getCategoryDetalis = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-        const categoryDetails = await categoryCollection.populateById({ id });
-        res.status(200).json(categoryDetails);
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, 'Server Error'));
     }
killedBy: Categories Routes should get an Category 
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:47:21
         const { id } = req.params;
         const categoryDetails = await categoryCollection.populateById({ id });
         res.status(200).json(categoryDetails);
-    } catch (error) {
-        next(new AppError(500, 'Server Error'));
-    }
+    } catch (error) {}
 };
 

[Timeout] BlockStatement
api/routes/eventcattest/testCathandler.js:53:50
 };
 
 
-const deleteCategory = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-
-        const deleteCategoory = await categoryCollection.destroy(id);
-        res.status(204).json(deleteCategoory);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
-};
+const deleteCategory = async (req, res, next) => {};
 
 const updateCategory = async (req, res, next) => {

[Timeout] BlockStatement
api/routes/eventcattest/testCathandler.js:54:9
 
 
 const deleteCategory = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-
-        const deleteCategoory = await categoryCollection.destroy(id);
-        res.status(204).json(deleteCategoory);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message));
     }

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:59:17
 
         const deleteCategoory = await categoryCollection.destroy(id);
         res.status(204).json(deleteCategoory);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 

[Timeout] BlockStatement
api/routes/eventcattest/testCathandler.js:65:9
 };
 
 const updateCategory = async (req, res, next) => {
-    try {
-        const newEvent = req.body.EventsCategory.new;
-        const deleteCEventID = req.body.EventsCategory.cancelled;
-        const { id } = req.params;
-        const results = await sequelize.transaction(async () => {
-            try {
-                const foundCategory = await categoryCollection.populateById({ id });
-                const addEvent = creatEvent(foundCategory, newEvent);
-                if (deleteCEventID) await eventCatCollection.destroyEventCat(deleteCEventID.id, id);
-                return {
-                    foundCategory,
-                    addEvent
-                };
-            } catch (error) {
-                throw new Error(error.message);
-            }
-        });
-
-        const result = {
-            results,
-            newEvent,
-            deleteCEventID
-        };
-        res.status(201).json(result);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message));
     }

[Timeout] BlockStatement
api/routes/eventcattest/testCathandler.js:69:65
         const newEvent = req.body.EventsCategory.new;
         const deleteCEventID = req.body.EventsCategory.cancelled;
         const { id } = req.params;
-        const results = await sequelize.transaction(async () => {
-            try {
-                const foundCategory = await categoryCollection.populateById({ id });
-                const addEvent = creatEvent(foundCategory, newEvent);
-                if (deleteCEventID) await eventCatCollection.destroyEventCat(deleteCEventID.id, id);
-                return {
-                    foundCategory,
-                    addEvent
-                };
-            } catch (error) {
-                throw new Error(error.message);
-            }
-        });
+        const results = await sequelize.transaction(async () => {});
 
         const result = {

[Timeout] BlockStatement
api/routes/eventcattest/testCathandler.js:70:17
         const deleteCEventID = req.body.EventsCategory.cancelled;
         const { id } = req.params;
         const results = await sequelize.transaction(async () => {
-            try {
-                const foundCategory = await categoryCollection.populateById({ id });
-                const addEvent = creatEvent(foundCategory, newEvent);
-                if (deleteCEventID) await eventCatCollection.destroyEventCat(deleteCEventID.id, id);
-                return {
-                    foundCategory,
-                    addEvent
-                };
-            } catch (error) {
+            try {} catch (error) {
                 throw new Error(error.message);
             }

[Timeout] ConditionalExpression
api/routes/eventcattest/testCathandler.js:73:21
             try {
                 const foundCategory = await categoryCollection.populateById({ id });
                 const addEvent = creatEvent(foundCategory, newEvent);
-                if (deleteCEventID) await eventCatCollection.destroyEventCat(deleteCEventID.id, id);
+                if (true) await eventCatCollection.destroyEventCat(deleteCEventID.id, id);
                 return {
                     foundCategory,

[Timeout] ConditionalExpression
api/routes/eventcattest/testCathandler.js:73:21
             try {
                 const foundCategory = await categoryCollection.populateById({ id });
                 const addEvent = creatEvent(foundCategory, newEvent);
-                if (deleteCEventID) await eventCatCollection.destroyEventCat(deleteCEventID.id, id);
+                if (false) await eventCatCollection.destroyEventCat(deleteCEventID.id, id);
                 return {
                     foundCategory,

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:78:29
                     foundCategory,
                     addEvent
                 };
-            } catch (error) {
-                throw new Error(error.message);
-            }
+            } catch (error) {}
         });
 

[NoCoverage] BlockStatement
api/routes/eventcattest/testCathandler.js:89:17
             deleteCEventID
         };
         res.status(201).json(result);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 
