[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:7:47
 const { extractCategories, creatcat } = require('../../controllers/bussiness-logic/categoriesOperations');
 const { AppError } = require('../../controllers/errorControllers');
 
-const createEvent = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const newEvent = { "eventType": data.eventType };
-        const createdEvent = await testCollection.create(newEvent);
-        const results = { createdEvent };
-        if (data.categories) {
-            results.toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(data.categories);
-            results.completeEvent = await createdEvent.addCategories(toBeAddedCategories);
-        }
-
-        res.status(200).send(results);
-    } catch (e) {
-
-        next(new AppError(401, e.message));
-    }
-};
+const createEvent = async (req, res, next) => {};
 
 const getEvents = async (req, res, next) => {

[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:8:9
 const { AppError } = require('../../controllers/errorControllers');
 
 const createEvent = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const newEvent = { "eventType": data.eventType };
-        const createdEvent = await testCollection.create(newEvent);
-        const results = { createdEvent };
-        if (data.categories) {
-            results.toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(data.categories);
-            results.completeEvent = await createdEvent.addCategories(toBeAddedCategories);
-        }
-
-        res.status(200).send(results);
-    } catch (e) {
+    try {} catch (e) {
 
         next(new AppError(401, e.message));

[Timeout] ObjectLiteral
api/routes/eventcattest/testhandlers.js:10:26
 const createEvent = async (req, res, next) => {
     try {
         const data = req.body;
-        const newEvent = { "eventType": data.eventType };
+        const newEvent = {};
         const createdEvent = await testCollection.create(newEvent);
         const results = { createdEvent };

[Killed] ObjectLiteral
api/routes/eventcattest/testhandlers.js:12:25
         const data = req.body;
         const newEvent = { "eventType": data.eventType };
         const createdEvent = await testCollection.create(newEvent);
-        const results = { createdEvent };
+        const results = {};
         if (data.categories) {
             results.toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(data.categories);
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] ConditionalExpression
api/routes/eventcattest/testhandlers.js:13:13
         const newEvent = { "eventType": data.eventType };
         const createdEvent = await testCollection.create(newEvent);
         const results = { createdEvent };
-        if (data.categories) {
+        if (true) {
             results.toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(data.categories);
             results.completeEvent = await createdEvent.addCategories(toBeAddedCategories);

[NoCoverage] BlockStatement
api/routes/eventcattest/testhandlers.js:13:30
         const newEvent = { "eventType": data.eventType };
         const createdEvent = await testCollection.create(newEvent);
         const results = { createdEvent };
-        if (data.categories) {
-            results.toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(data.categories);
-            results.completeEvent = await createdEvent.addCategories(toBeAddedCategories);
-        }
+        if (data.categories) {}
 
         res.status(200).send(results);

[NoCoverage] BlockStatement
api/routes/eventcattest/testhandlers.js:19:17
         }
 
         res.status(200).send(results);
-    } catch (e) {
-
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/eventcattest/testhandlers.js:25:45
     }
 };
 
-const getEvents = async (req, res, next) => {
-    try {
-        const eventsData = await testCollection.readAllPopulated();
-        res.status(200).json(eventsData);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
-};
+const getEvents = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/eventcattest/testhandlers.js:26:9
 };
 
 const getEvents = async (req, res, next) => {
-    try {
-        const eventsData = await testCollection.readAllPopulated();
-        res.status(200).json(eventsData);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, e.message));
     }

[NoCoverage] BlockStatement
api/routes/eventcattest/testhandlers.js:29:17
     try {
         const eventsData = await testCollection.readAllPopulated();
         res.status(200).json(eventsData);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
+    } catch (e) {}
 };
 

[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:35:51
 };
 
 
-const getEventDetalis = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-        const eventDetails = await testCollection.populateById({ id });
-        res.status(200).json(eventDetails);
-    } catch (error) {
-        next(new AppError(500, 'Server Error'));
-    }
-};
+const getEventDetalis = async (req, res, next) => {};
 
 

[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:36:9
 
 
 const getEventDetalis = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-        const eventDetails = await testCollection.populateById({ id });
-        res.status(200).json(eventDetails);
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, 'Server Error'));
     }

[NoCoverage] BlockStatement
api/routes/eventcattest/testhandlers.js:40:21
         const { id } = req.params;
         const eventDetails = await testCollection.populateById({ id });
         res.status(200).json(eventDetails);
-    } catch (error) {
-        next(new AppError(500, 'Server Error'));
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
api/routes/eventcattest/testhandlers.js:41:32
         const eventDetails = await testCollection.populateById({ id });
         res.status(200).json(eventDetails);
     } catch (error) {
-        next(new AppError(500, 'Server Error'));
+        next(new AppError(500, ""));
     }
 };

[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:46:47
 };
 
 
-const deleteEvent = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-
-        const deleteEvent = await testCollection.destroy(id);
-        res.status(204).json(deleteEvent);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
-};
+const deleteEvent = async (req, res, next) => {};
 
 const updateEvent = async (req, res, next) => {

[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:47:9
 
 
 const deleteEvent = async (req, res, next) => {
-    try {
-        const { id } = req.params;
-
-        const deleteEvent = await testCollection.destroy(id);
-        res.status(204).json(deleteEvent);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message));
     }

[NoCoverage] BlockStatement
api/routes/eventcattest/testhandlers.js:52:17
 
         const deleteEvent = await testCollection.destroy(id);
         res.status(204).json(deleteEvent);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 

[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:57:47
     }
 };
 
-const updateEvent = async (req, res, next) => {
-    try {
-        const newCat = req.body.EventsCategory.new;
-        const deleteCatID = req.body.EventsCategory.cancelled;
-        const { id } = req.params;
-        const foundEvent = await testCollection.populateById({ id });
-        const addCategories = await creatcat(foundEvent, newCat);
-        // if (newCat) {
-        //     const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(newCat);
-        //     const addedCategories = await foundEvent.addCategories(toBeAddedCategories);
-        // }
-        if (deleteCatID) { var deleted = await eventCatCollection.destroyEventCat(id, deleteCatID.id); }
-        const result = {
-            foundEvent,
-            newCat,
-            deleteCatID,
-            addCategories,
-            deleted
-        };
-        res.status(201).json(result);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
-};
+const updateEvent = async (req, res, next) => {};
 
 

[Timeout] BlockStatement
api/routes/eventcattest/testhandlers.js:58:9
 };
 
 const updateEvent = async (req, res, next) => {
-    try {
-        const newCat = req.body.EventsCategory.new;
-        const deleteCatID = req.body.EventsCategory.cancelled;
-        const { id } = req.params;
-        const foundEvent = await testCollection.populateById({ id });
-        const addCategories = await creatcat(foundEvent, newCat);
-        // if (newCat) {
-        //     const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(newCat);
-        //     const addedCategories = await foundEvent.addCategories(toBeAddedCategories);
-        // }
-        if (deleteCatID) { var deleted = await eventCatCollection.destroyEventCat(id, deleteCatID.id); }
-        const result = {
-            foundEvent,
-            newCat,
-            deleteCatID,
-            addCategories,
-            deleted
-        };
-        res.status(201).json(result);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message));
     }

[Timeout] ConditionalExpression
api/routes/eventcattest/testhandlers.js:68:13
         //     const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(newCat);
         //     const addedCategories = await foundEvent.addCategories(toBeAddedCategories);
         // }
-        if (deleteCatID) { var deleted = await eventCatCollection.destroyEventCat(id, deleteCatID.id); }
+        if (true) { var deleted = await eventCatCollection.destroyEventCat(id, deleteCatID.id); }
         const result = {
             foundEvent,

[Timeout] ConditionalExpression
api/routes/eventcattest/testhandlers.js:68:13
         //     const toBeAddedCategories = await categoryCollection.readAllRecordsWithCondition(newCat);
         //     const addedCategories = await foundEvent.addCategories(toBeAddedCategories);
         // }
-        if (deleteCatID) { var deleted = await eventCatCollection.destroyEventCat(id, deleteCatID.id); }
+        if (false) { var deleted = await eventCatCollection.destroyEventCat(id, deleteCatID.id); }
         const result = {
             foundEvent,

[Timeout] ObjectLiteral
api/routes/eventcattest/testhandlers.js:69:24
         //     const addedCategories = await foundEvent.addCategories(toBeAddedCategories);
         // }
         if (deleteCatID) { var deleted = await eventCatCollection.destroyEventCat(id, deleteCatID.id); }
-        const result = {
-            foundEvent,
-            newCat,
-            deleteCatID,
-            addCategories,
-            deleted
-        };
+        const result = {};
         res.status(201).json(result);
     } catch (e) {
