[NoCoverage] BlockStatement
api/routes/events/events.handlers.js:7:54
 const AppError = require("../../controllers/errorControllers/error-class");
 
 
-const createEventWithCat = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { categories } = data;
-        const createdEvent = await eventCollection.createWithNested(data, ['categories']);
-        const result = {
-            categories,
-            createdEvent
-        };
-        res.status(200).send(result);
-
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
-
-};
+const createEventWithCat = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/events/events.handlers.js:8:9
 
 
 const createEventWithCat = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { categories } = data;
-        const createdEvent = await eventCollection.createWithNested(data, ['categories']);
-        const result = {
-            categories,
-            createdEvent
-        };
-        res.status(200).send(result);
-
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, error.message));
     }

[NoCoverage] StringLiteral
api/routes/events/events.handlers.js:11:76
     try {
         const data = req.body;
         const { categories } = data;
-        const createdEvent = await eventCollection.createWithNested(data, ['categories']);
+        const createdEvent = await eventCollection.createWithNested(data, [""]);
         const result = {
             categories,

[NoCoverage] BlockStatement
api/routes/events/events.handlers.js:25:50
 };
 
 
-const updateEventCat = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { id } = req.params;
-        const { categories } = data;
-        const data1 = { id };
-        const foundEvent = await eventCollection.populateById(data1);
-        const data2 = categories;
-        const cats = await categoryCollection.readAllRecordsWithCondition(data2);
-        const addedCat = await foundEvent.addCategories(cats);
-        const result = {
-            categories,
-            foundEvent,
-            cats,
-            addedCat
-        };
-        res.status(200).send(result);
-    } catch (error) {
-        next(new AppError(500, error.message));
-    }
-};
+const updateEventCat = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/events/events.handlers.js:26:9
 
 
 const updateEventCat = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const { id } = req.params;
-        const { categories } = data;
-        const data1 = { id };
-        const foundEvent = await eventCollection.populateById(data1);
-        const data2 = categories;
-        const cats = await categoryCollection.readAllRecordsWithCondition(data2);
-        const addedCat = await foundEvent.addCategories(cats);
-        const result = {
-            categories,
-            foundEvent,
-            cats,
-            addedCat
-        };
-        res.status(200).send(result);
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, error.message));
     }
