[NoCoverage] BlockStatement
api/routes/order-details/orderDetails.handlers.js:13:51
 
 
 
-const addOrderDetails = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const createdDetails = await orderDetailsCollection.createInBulk(data);
-        res.status(200).json(createdDetails);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
-};
+const addOrderDetails = async (req, res, next) => {};
 
 const createFilledOrder = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/order-details/orderDetails.handlers.js:14:9
 
 
 const addOrderDetails = async (req, res, next) => {
-    try {
-        const data = req.body;
-        const createdDetails = await orderDetailsCollection.createInBulk(data);
-        res.status(200).json(createdDetails);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, e.message));
     }

[NoCoverage] BlockStatement
api/routes/order-details/orderDetails.handlers.js:18:17
         const data = req.body;
         const createdDetails = await orderDetailsCollection.createInBulk(data);
         res.status(200).json(createdDetails);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
+    } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/order-details/orderDetails.handlers.js:23:53
     }
 };
 
-const createFilledOrder = async (req, res, next) => {
-    try {
-        const data = req.body;
-        data.totalPrice = calculateTotalPrice(data.details);
-        const { newTrackers, existingTrackers } = extractRentalItem(data);
-        const saleItems = extractSaleItem(data);
-        const updatedSaleItems = await updateSaleItemQuantity(saleItems);
-        const createdTrackers = await createTrackersInBulk(newTrackers);
-        const updatedTrackers = await updateRentalTrackerQuantity(existingTrackers);
-        const createdOrder = await orderCollection.createWithNested(data, ['details']);
-        const result = {
-            saleItems,
-            createdTrackers,
-            updatedSaleItems,
-            updatedTrackers,
-            createdOrder
-        };
-        res.status(200).send(result);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
-};
+const createFilledOrder = async (req, res, next) => {};
 
 module.exports = {

[NoCoverage] BlockStatement
api/routes/order-details/orderDetails.handlers.js:24:9
 };
 
 const createFilledOrder = async (req, res, next) => {
-    try {
-        const data = req.body;
-        data.totalPrice = calculateTotalPrice(data.details);
-        const { newTrackers, existingTrackers } = extractRentalItem(data);
-        const saleItems = extractSaleItem(data);
-        const updatedSaleItems = await updateSaleItemQuantity(saleItems);
-        const createdTrackers = await createTrackersInBulk(newTrackers);
-        const updatedTrackers = await updateRentalTrackerQuantity(existingTrackers);
-        const createdOrder = await orderCollection.createWithNested(data, ['details']);
-        const result = {
-            saleItems,
-            createdTrackers,
-            updatedSaleItems,
-            updatedTrackers,
-            createdOrder
-        };
-        res.status(200).send(result);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, e.message));
     }

[NoCoverage] BlockStatement
api/routes/order-details/orderDetails.handlers.js:41:17
             createdOrder
         };
         res.status(200).send(result);
-    } catch (e) {
-        next(new AppError(500, e.message));
-    }
+    } catch (e) {}
 };
 
