[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:9:52
 
 
 
-const createRentalItem = async (req, res, next) => {
-    try {
-        const newRentalItem = req.body
-        // newRentalItem.imgPath = req.file.path
-        // newRentalItem.imgName = req.file.name
-        const addedRentalItem = await rentalItemsCollection.create(newRentalItem)
-        res.status(201).json(addedRentalItem)
-
-    } catch (e) {
-        next(new AppError(500, `Server Error: Item creation failed`))
-    }
-}
+const createRentalItem = async (req, res, next) => {}
 
 

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:10:9
 
 
 const createRentalItem = async (req, res, next) => {
-    try {
-        const newRentalItem = req.body
-        // newRentalItem.imgPath = req.file.path
-        // newRentalItem.imgName = req.file.name
-        const addedRentalItem = await rentalItemsCollection.create(newRentalItem)
-        res.status(201).json(addedRentalItem)
-
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, `Server Error: Item creation failed`))
     }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:17:17
         const addedRentalItem = await rentalItemsCollection.create(newRentalItem)
         res.status(201).json(addedRentalItem)
 
-    } catch (e) {
-        next(new AppError(500, `Server Error: Item creation failed`))
-    }
+    } catch (e) {}
 }
 

[NoCoverage] StringLiteral
api/routes/rental-items/rentalItem-controller.js:18:32
         res.status(201).json(addedRentalItem)
 
     } catch (e) {
-        next(new AppError(500, `Server Error: Item creation failed`))
+        next(new AppError(500, ``))
     }
 }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:23:52
 }
 
 
-const updateRentalItem = async (req, res, next) => {
-    try {
-        const { id } = req.params
-        const updatedRentalItem = req.body
-        const updatedItem = await rentalItemsCollection.update(id, updatedRentalItem)
-        res.status(200).json(updatedItem)
-    } catch (e) {
-        next(new AppError(500, `Server Error: Item updating failed`))
-    }
-}
+const updateRentalItem = async (req, res, next) => {}
 
 

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:24:9
 
 
 const updateRentalItem = async (req, res, next) => {
-    try {
-        const { id } = req.params
-        const updatedRentalItem = req.body
-        const updatedItem = await rentalItemsCollection.update(id, updatedRentalItem)
-        res.status(200).json(updatedItem)
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(500, `Server Error: Item updating failed`))
     }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:29:17
         const updatedRentalItem = req.body
         const updatedItem = await rentalItemsCollection.update(id, updatedRentalItem)
         res.status(200).json(updatedItem)
-    } catch (e) {
-        next(new AppError(500, `Server Error: Item updating failed`))
-    }
+    } catch (e) {}
 }
 

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:35:52
 }
 
 
-const deleteRentalItem = async (req, res, next) => {
-    try {
-        const { id } = req.params
-        const deletedItem = await rentalItemsCollection.destroy(id)
-        res.status(204)
-    } catch (error) {
-        next(new AppError(500, `Server Error, Item deletion failed`))
-    }
-}
+const deleteRentalItem = async (req, res, next) => {}
 
 const getRentalItemDetails = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:36:9
 
 
 const deleteRentalItem = async (req, res, next) => {
-    try {
-        const { id } = req.params
-        const deletedItem = await rentalItemsCollection.destroy(id)
-        res.status(204)
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, `Server Error, Item deletion failed`))
     }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:40:21
         const { id } = req.params
         const deletedItem = await rentalItemsCollection.destroy(id)
         res.status(204)
-    } catch (error) {
-        next(new AppError(500, `Server Error, Item deletion failed`))
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
api/routes/rental-items/rentalItem-controller.js:41:32
         const deletedItem = await rentalItemsCollection.destroy(id)
         res.status(204)
     } catch (error) {
-        next(new AppError(500, `Server Error, Item deletion failed`))
+        next(new AppError(500, ``))
     }
 }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:45:56
     }
 }
 
-const getRentalItemDetails = async (req, res, next) => {
-    try {
-        const { filter } = req.query
-        const { id } = req.params
-        const item = await rentalItemsCollection.populateById(id, filter)
-        res.status(200).json(item)
-    } catch (error) {
-        next(new AppError(500, `Server Error, Can't retrieve data`))
-    }
-}
+const getRentalItemDetails = async (req, res, next) => {}
 
 

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:46:9
 }
 
 const getRentalItemDetails = async (req, res, next) => {
-    try {
-        const { filter } = req.query
-        const { id } = req.params
-        const item = await rentalItemsCollection.populateById(id, filter)
-        res.status(200).json(item)
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, `Server Error, Can't retrieve data`))
     }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:51:21
         const { id } = req.params
         const item = await rentalItemsCollection.populateById(id, filter)
         res.status(200).json(item)
-    } catch (error) {
-        next(new AppError(500, `Server Error, Can't retrieve data`))
-    }
+    } catch (error) {}
 }
 

[NoCoverage] StringLiteral
api/routes/rental-items/rentalItem-controller.js:52:32
         const item = await rentalItemsCollection.populateById(id, filter)
         res.status(200).json(item)
     } catch (error) {
-        next(new AppError(500, `Server Error, Can't retrieve data`))
+        next(new AppError(500, ``))
     }
 }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:57:53
 }
 
 
-const getAllRentalItems = async (req, res, next) => {
-    try {
-        const rentalItems = await rentalItemsCollection.readAllRecords()
-        res.status(200).json(rentalItems)
-    } catch (error) {
-        next(new AppError(500, `Server Error, Can't retrieve data`))
-    }
-}
+const getAllRentalItems = async (req, res, next) => {}
 
 

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:58:9
 
 
 const getAllRentalItems = async (req, res, next) => {
-    try {
-        const rentalItems = await rentalItemsCollection.readAllRecords()
-        res.status(200).json(rentalItems)
-    } catch (error) {
+    try {} catch (error) {
         next(new AppError(500, `Server Error, Can't retrieve data`))
     }

[NoCoverage] BlockStatement
api/routes/rental-items/rentalItem-controller.js:61:21
     try {
         const rentalItems = await rentalItemsCollection.readAllRecords()
         res.status(200).json(rentalItems)
-    } catch (error) {
-        next(new AppError(500, `Server Error, Can't retrieve data`))
-    }
+    } catch (error) {}
 }
 
