[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:7:51
 const { AppError } = require("../../controllers/errorControllers");
 
 
-const getOneSaleItems = async (req, res, next) => {
-    const { id } = req.params;
-    try {
-        const item = await saleItemCollection.populateById(id);
-        res.status(200).send(item);
-    } catch (e) {
-        next(new AppError(401, 'cannot read Items'));
-    }
-};
+const getOneSaleItems = async (req, res, next) => {};
 
 const getAllSaleItems = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:9:9
 
 const getOneSaleItems = async (req, res, next) => {
     const { id } = req.params;
-    try {
-        const item = await saleItemCollection.populateById(id);
-        res.status(200).send(item);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, 'cannot read Items'));
     }

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:12:17
     try {
         const item = await saleItemCollection.populateById(id);
         res.status(200).send(item);
-    } catch (e) {
-        next(new AppError(401, 'cannot read Items'));
-    }
+    } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:17:51
     }
 };
 
-const getAllSaleItems = async (req, res, next) => {
-    try {
-        const allItem = await saleItemCollection.readAllRecords();
-        res.status(200).send(allItem);
-    } catch (e) {
-        next(new AppError(401, 'cannot read Items'));
-    }
-};
+const getAllSaleItems = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:18:9
 };
 
 const getAllSaleItems = async (req, res, next) => {
-    try {
-        const allItem = await saleItemCollection.readAllRecords();
-        res.status(200).send(allItem);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, 'cannot read Items'));
     }

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:21:17
     try {
         const allItem = await saleItemCollection.readAllRecords();
         res.status(200).send(allItem);
-    } catch (e) {
-        next(new AppError(401, 'cannot read Items'));
-    }
+    } catch (e) {}
 };
 

[Timeout] BlockStatement
api/routes/saleItem/saleItemController.js:27:50
 };
 
 
-const createSaleItem = async (req, res, next) => {
-    const itemData = req.body;
-    // itemData.imgPath = req.file.path
-    // itemData.imgNAme = req.file.filename
-    try {
-        const newItem = await saleItemCollection.create(itemData);
-        res.status(201).send(newItem);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
-};
+const createSaleItem = async (req, res, next) => {};
 
 

[Timeout] BlockStatement
api/routes/saleItem/saleItemController.js:31:9
     const itemData = req.body;
     // itemData.imgPath = req.file.path
     // itemData.imgNAme = req.file.filename
-    try {
-        const newItem = await saleItemCollection.create(itemData);
-        res.status(201).send(newItem);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message));
     }

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:34:17
     try {
         const newItem = await saleItemCollection.create(itemData);
         res.status(201).send(newItem);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:40:50
 };
 
 
-const updateSaleItem = async (req, res, next) => {
-    const newData = req.body;
-    const { id } = req.params;
-    try {
-        const newItem = await saleItemCollection.update(id, newData);
-        res.status(202).send(newItem);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
-};
+const updateSaleItem = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:43:9
 const updateSaleItem = async (req, res, next) => {
     const newData = req.body;
     const { id } = req.params;
-    try {
-        const newItem = await saleItemCollection.update(id, newData);
-        res.status(202).send(newItem);
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message));
     }

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:46:17
     try {
         const newItem = await saleItemCollection.update(id, newData);
         res.status(202).send(newItem);
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:52:50
 };
 
 
-const deleteSaleItem = async (req, res, next) => {
-    const { id } = req.params;
-    try {
-        await saleItemCollection.destroy(id);
-        res.status(204).send('the item deleted successfully');
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
-};
+const deleteSaleItem = async (req, res, next) => {};
 
 

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:54:9
 
 const deleteSaleItem = async (req, res, next) => {
     const { id } = req.params;
-    try {
-        await saleItemCollection.destroy(id);
-        res.status(204).send('the item deleted successfully');
-    } catch (e) {
+    try {} catch (e) {
         next(new AppError(401, e.message));
     }

[NoCoverage] BlockStatement
api/routes/saleItem/saleItemController.js:57:17
     try {
         await saleItemCollection.destroy(id);
         res.status(204).send('the item deleted successfully');
-    } catch (e) {
-        next(new AppError(401, e.message));
-    }
+    } catch (e) {}
 };
 
