[NoCoverage] BlockStatement
api/routes/store/store.controller.js:6:47
 const { storeCollection } = require('../../../models');
 const { AppError } = require('../../controllers/errorControllers');
 
-const createStore = async (req, res, next) => {
-  try {
-    const newStore = req.body;
-    // newStore.logoPath = req.file.path;
-    // newStore.logoName = req.file.filename;
-    const createdStore = await storeCollection.create(newStore);
-    res.status(201).json(createdStore);
-  } catch (e) {
-    next(new AppError(401, 'Cannot Create Store'));
-  }
-};
+const createStore = async (req, res, next) => {};
 
 const getStores = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:7:7
 const { AppError } = require('../../controllers/errorControllers');
 
 const createStore = async (req, res, next) => {
-  try {
-    const newStore = req.body;
-    // newStore.logoPath = req.file.path;
-    // newStore.logoName = req.file.filename;
-    const createdStore = await storeCollection.create(newStore);
-    res.status(201).json(createdStore);
-  } catch (e) {
+  try {} catch (e) {
     next(new AppError(401, 'Cannot Create Store'));
   }

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:13:15
     // newStore.logoName = req.file.filename;
     const createdStore = await storeCollection.create(newStore);
     res.status(201).json(createdStore);
-  } catch (e) {
-    next(new AppError(401, 'Cannot Create Store'));
-  }
+  } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:18:45
   }
 };
 
-const getStores = async (req, res, next) => {
-  try {
-    const storesData = await storeCollection.readAllRecords()
-    res.status(200).json(storesData)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
-}
+const getStores = async (req, res, next) => {}
 
 

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:19:7
 };
 
 const getStores = async (req, res, next) => {
-  try {
-    const storesData = await storeCollection.readAllRecords()
-    res.status(200).json(storesData)
-  } catch (error) {
+  try {} catch (error) {
     next(new AppError(500, 'Server Error'))
   }

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:22:19
   try {
     const storesData = await storeCollection.readAllRecords()
     res.status(200).json(storesData)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:28:51
 }
 
 
-const getStoreDetalis = async (req, res, next) => {
-  try {
-    const { id } = req.params
-    const storeDetails = await storeCollection.populateById(id)
-    res.status(200).json(storeDetails)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
-}
+const getStoreDetalis = async (req, res, next) => {}
 
 

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:29:7
 
 
 const getStoreDetalis = async (req, res, next) => {
-  try {
-    const { id } = req.params
-    const storeDetails = await storeCollection.populateById(id)
-    res.status(200).json(storeDetails)
-  } catch (error) {
+  try {} catch (error) {
     next(new AppError(500, 'Server Error'))
   }

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:33:19
     const { id } = req.params
     const storeDetails = await storeCollection.populateById(id)
     res.status(200).json(storeDetails)
-  } catch (error) {
-    next(new AppError(500, 'Server Error'))
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:39:47
 }
 
 
-const deleteStore = async (req, res, next) => {
-  try {
-    const { id } = req.params;
-
-    const deleteStore = await storeCollection.destroy(id);
-    res.status(204).json(deleteStore);
-  } catch (e) {
-    next(new AppError(401, 'Cannot Delete Store'));
-  }
-};
+const deleteStore = async (req, res, next) => {};
 
 const updateStore = async (req, res, next) => {

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:40:7
 
 
 const deleteStore = async (req, res, next) => {
-  try {
-    const { id } = req.params;
-
-    const deleteStore = await storeCollection.destroy(id);
-    res.status(204).json(deleteStore);
-  } catch (e) {
+  try {} catch (e) {
     next(new AppError(401, 'Cannot Delete Store'));
   }

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:45:15
 
     const deleteStore = await storeCollection.destroy(id);
     res.status(204).json(deleteStore);
-  } catch (e) {
-    next(new AppError(401, 'Cannot Delete Store'));
-  }
+  } catch (e) {}
 };
 

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:50:47
   }
 };
 
-const updateStore = async (req, res, next) => {
-  try {
-    const newStore = req.body;
-    const { id } = req.params;
-    // newStore.logoPath = req.file.path;
-    // newStore.logoName = req.file.filename;
-    const updatedStore = await storeCollection.update(id, newStore);
-    res.status(201).json(updatedStore);
-  } catch (e) {
-    next(new AppError(401, 'Cannot Update Store'));
-  }
-};
+const updateStore = async (req, res, next) => {};
 
 module.exports = {

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:51:7
 };
 
 const updateStore = async (req, res, next) => {
-  try {
-    const newStore = req.body;
-    const { id } = req.params;
-    // newStore.logoPath = req.file.path;
-    // newStore.logoName = req.file.filename;
-    const updatedStore = await storeCollection.update(id, newStore);
-    res.status(201).json(updatedStore);
-  } catch (e) {
+  try {} catch (e) {
     next(new AppError(401, 'Cannot Update Store'));
   }

[NoCoverage] BlockStatement
api/routes/store/store.controller.js:58:15
     // newStore.logoName = req.file.filename;
     const updatedStore = await storeCollection.update(id, newStore);
     res.status(201).json(updatedStore);
-  } catch (e) {
-    next(new AppError(401, 'Cannot Update Store'));
-  }
+  } catch (e) {}
 };
 

[NoCoverage] StringLiteral
api/routes/store/store.controller.js:59:28
     const updatedStore = await storeCollection.update(id, newStore);
     res.status(201).json(updatedStore);
   } catch (e) {
-    next(new AppError(401, 'Cannot Update Store'));
+    next(new AppError(401, ""));
   }
 };
