[Timeout] BlockStatement
src/server.js:35:28
 app.use(eventsCatRouter);
 app.use(testeventRouter);
 app.use(testCatRouter);
-app.get('/', (req, res) => {
-    res.status(200).send('Hello World');
-});
+app.get('/', (req, res) => {});
 
 

[NoCoverage] BlockStatement
src/server.js:40:25
 });
 
 
-const start = (port) => {
-    app.listen(port, (req, res) => {
-        console.log(`Diamond City Radio on port  ${port}`);
-    });
-};
+const start = (port) => {};
 
 app.get('*', pageNotFoundHandler);

[NoCoverage] BlockStatement
src/server.js:41:36
 
 
 const start = (port) => {
-    app.listen(port, (req, res) => {
-        console.log(`Diamond City Radio on port  ${port}`);
-    });
+    app.listen(port, (req, res) => {});
 };
 
