[Timeout] ObjectLiteral
api/controllers/errorControllers/index.js:5:18
 const errorHandler = require("./error-handler")
 const pageNotFoundHandler = require("./pageNotFundHandler")
 
-module.exports = {
-    AppError,
-    errorHandler,
-    pageNotFoundHandler
-}
+module.exports = {}
