[Killed] StringLiteral
api/routes/Order/order.routes.js:11:17
 const orderRouter = express.Router();
 
 orderRouter.post("/order", isUserVerefied, createOrder);
-orderRouter.get('/order', getOrders)
+orderRouter.get("", getOrders)
 orderRouter.get('/order/:id', getOrderDetails)
 orderRouter.put("/order/:id", isUserVerefied, isAuthorized, updateOrder);
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
