[Timeout] StringLiteral
api/routes/User/user.routes.js:14:17
 
 
 
-authRouter.post('/signup', isUserExist, signup)
+authRouter.post("", isUserExist, signup)
 authRouter.post('/signin', checkUserCreds, signin)
 authRouter.delete('/signout', signout)
