[Timeout] StringLiteral
api/routes/categories/categories.routes.js:14:15
 
 catRouter.post('/cat', createCatWithEvent);
 catRouter.put('/cat/:id', updateExistingCatEvents);
-catRouter.get('/cat', findAll);
+catRouter.get("", findAll);
 catRouter.patch('/cat', createEventAndAddCategories);
 
