[Timeout] StringLiteral
api/routes/eventcattest/test.routes.js:11:21
 const testeventRouter = express.Router()
 
 testeventRouter.get('/testevent', isUserVerefied, isAuthorized, getEvents)
-testeventRouter.get('/testevent/:id', isUserVerefied, isAuthorized, getEventDetalis)
+testeventRouter.get("", isUserVerefied, isAuthorized, getEventDetalis)
 testeventRouter.post('/testevent', isUserVerefied, createEvent)
 testeventRouter.put('/testevent/:id', isUserVerefied, isAuthorized, updateEvent)

[Timeout] StringLiteral
api/routes/eventcattest/test.routes.js:13:21
 testeventRouter.get('/testevent', isUserVerefied, isAuthorized, getEvents)
 testeventRouter.get('/testevent/:id', isUserVerefied, isAuthorized, getEventDetalis)
 testeventRouter.post('/testevent', isUserVerefied, createEvent)
-testeventRouter.put('/testevent/:id', isUserVerefied, isAuthorized, updateEvent)
+testeventRouter.put("", isUserVerefied, isAuthorized, updateEvent)
 testeventRouter.delete('/testevent/:id', isUserVerefied, isAuthorized, deleteEvent)
 
