[Timeout] StringLiteral
api/routes/eventcattest/testCat.routes.js:11:19
 const testCatRouter = express.Router()
 
 testCatRouter.get('/testcat', isUserVerefied, isAuthorized, getCategory)
-testCatRouter.get('/testcat/:id', isUserVerefied, isAuthorized, getCategoryDetalis)
+testCatRouter.get("", isUserVerefied, isAuthorized, getCategoryDetalis)
 testCatRouter.post('/testcat', createCat)
 testCatRouter.put('/testcat/:id', isUserVerefied, isAuthorized, updateCategory)

[Killed] StringLiteral
api/routes/eventcattest/testCat.routes.js:13:19
 testCatRouter.get('/testcat', isUserVerefied, isAuthorized, getCategory)
 testCatRouter.get('/testcat/:id', isUserVerefied, isAuthorized, getCategoryDetalis)
 testCatRouter.post('/testcat', createCat)
-testCatRouter.put('/testcat/:id', isUserVerefied, isAuthorized, updateCategory)
+testCatRouter.put("", isUserVerefied, isAuthorized, updateCategory)
 testCatRouter.delete('/testcat/:id', isUserVerefied, isAuthorized, deleteCategory)
 
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
