[Timeout] StringLiteral
api/routes/events/event.routes.js:13:21
 
 
 eventsCatRouter.post('/event', createEventWithCat);
-eventsCatRouter.put('/event/:id', updateEventCat);
+eventsCatRouter.put("", updateEventCat);
 
 
