[Timeout] StringLiteral
api/routes/rental-items/rentalItem.routes.js:14:22
 
 
 
-rentalItemRouter.get('/rental/:id', isUserVerefied, getRentalItemDetails)
+rentalItemRouter.get("", isUserVerefied, getRentalItemDetails)
 rentalItemRouter.post('/rental', isUserVerefied, createRentalItem)
 rentalItemRouter.put('/rental/:id', isUserVerefied, isAuthorized, updateRentalItem)

[Timeout] StringLiteral
api/routes/rental-items/rentalItem.routes.js:16:22
 
 rentalItemRouter.get('/rental/:id', isUserVerefied, getRentalItemDetails)
 rentalItemRouter.post('/rental', isUserVerefied, createRentalItem)
-rentalItemRouter.put('/rental/:id', isUserVerefied, isAuthorized, updateRentalItem)
+rentalItemRouter.put("", isUserVerefied, isAuthorized, updateRentalItem)
 rentalItemRouter.delete('/rental/:id', isUserVerefied, isAuthorized, deleteRentalItem)
 
