[Timeout] StringLiteral
api/routes/saleItem/saleItem.routes.js:18:20
 saleItemRouter.post('/sale',
     //  upload.single('img'),
     isUserVerefied, createSaleItem)
-saleItemRouter.put('/sale/:id',
+saleItemRouter.put("",
     //  upload.single('img'), 
     isUserVerefied, isAuthorized, updateSaleItem)
