[Timeout] StringLiteral
api/routes/store/store.routes.js:17:18
 
 storeRoutes.get('/store', getStores)
 storeRoutes.get('/store/:id', getStoreDetalis)
-storeRoutes.post('/store', isUserVerefied, createStore)
+storeRoutes.post("", isUserVerefied, createStore)
 storeRoutes.put('/store/:id', isUserVerefied, isAuthorized, updateStore)
 storeRoutes.delete('/store/:id', isUserVerefied, isAuthorized, deleteStore)
