[Timeout] StringLiteral
src/config/cloudinary.js:15:17
 const storage = new CloudinaryStorage({
     cloudinary,
     params: {
-        folder: 'Evently',
+        folder: "",
         allowedFormats: ['jpeg', 'png', 'jpg']
     }

[Timeout] StringLiteral
src/config/cloudinary.js:16:41
     cloudinary,
     params: {
         folder: 'Evently',
-        allowedFormats: ['jpeg', 'png', 'jpg']
+        allowedFormats: ['jpeg', 'png', ""]
     }
 })

[Timeout] StringLiteral
src/config/cloudinary.js:16:26
     cloudinary,
     params: {
         folder: 'Evently',
-        allowedFormats: ['jpeg', 'png', 'jpg']
+        allowedFormats: ["", 'png', 'jpg']
     }
 })

[Timeout] ObjectLiteral
src/config/cloudinary.js:20:23
     }
 })
 
-const upload = multer({ storage })
+const upload = multer({})
 
 module.exports = {
