[Killed] ConditionalExpression
src/config/index.js:3:5
 'use strict';
 
-if (process.env.NODE_ENV !== "production") {
+if (true) {
     require('dotenv').config();
 }
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] StringLiteral
src/config/index.js:3:30
 'use strict';
 
-if (process.env.NODE_ENV !== "production") {
+if (process.env.NODE_ENV !== "") {
     require('dotenv').config();
 }

[Timeout] BooleanLiteral
src/config/index.js:14:22
 const sequelizeOption = {
     dialectOptions: {
         ssl: {
-            require: true,
+            require: false,
             rejectUnauthorized: false
         }

[Timeout] BooleanLiteral
src/config/index.js:15:33
     dialectOptions: {
         ssl: {
             require: true,
-            rejectUnauthorized: false
+            rejectUnauthorized: true
         }
     }
