[Killed] ObjectLiteral
src/config/test-config.js:7:18
 const server = require('../server.js');
 const request = supertest(server.app);
 
-module.exports = { request }
+module.exports = {}
killedBy: Server is a live should get to "/"
statusReason: TypeError: Cannot read properties of undefined (reading 'get')
