[Timeout] StringLiteral
src/models/index.js:39:41
 userModel.hasMany(storeModel, { as: 'stores' });
 storeModel.belongsTo(userModel);
 
-storeModel.hasMany(saleItemModel, { as: 'saleItems' });
+storeModel.hasMany(saleItemModel, { as: "" });
 saleItemModel.belongsTo(storeModel);
 

[Timeout] ObjectLiteral
src/models/index.js:45:46
 storeModel.hasMany(rentalItemModel, { as: 'rentalItems' });
 rentalItemModel.belongsTo(storeModel);
 
-rentalItemModel.hasMany(rentalTrackingmodel, { as: 'trackers' });
+rentalItemModel.hasMany(rentalTrackingmodel, {});
 rentalTrackingmodel.belongsTo(rentalItemModel);
 

[Timeout] StringLiteral
src/models/index.js:45:52
 storeModel.hasMany(rentalItemModel, { as: 'rentalItems' });
 rentalItemModel.belongsTo(storeModel);
 
-rentalItemModel.hasMany(rentalTrackingmodel, { as: 'trackers' });
+rentalItemModel.hasMany(rentalTrackingmodel, { as: "" });
 rentalTrackingmodel.belongsTo(rentalItemModel);
 

[Timeout] ObjectLiteral
src/models/index.js:51:40
 categoryModel.hasMany(saleItemModel, { as: 'saleItems' });
 saleItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
 
-categoryModel.hasMany(rentalItemModel, { as: 'rentalItems' });
+categoryModel.hasMany(rentalItemModel, {});
 rentalItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
 

[Timeout] StringLiteral
src/models/index.js:51:46
 categoryModel.hasMany(saleItemModel, { as: 'saleItems' });
 saleItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
 
-categoryModel.hasMany(rentalItemModel, { as: 'rentalItems' });
+categoryModel.hasMany(rentalItemModel, { as: "" });
 rentalItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
 

[Timeout] StringLiteral
src/models/index.js:52:75
 saleItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
 
 categoryModel.hasMany(rentalItemModel, { as: 'rentalItems' });
-rentalItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
+rentalItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: "" });
 
 userModel.hasMany(orderModel, { as: 'orders' });

[Timeout] ObjectLiteral
src/models/index.js:52:42
 saleItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
 
 categoryModel.hasMany(rentalItemModel, { as: 'rentalItems' });
-rentalItemModel.belongsTo(categoryModel, { targetKey: 'name', foreignKey: 'CatName' });
+rentalItemModel.belongsTo(categoryModel, {});
 
 userModel.hasMany(orderModel, { as: 'orders' });

[Timeout] StringLiteral
src/models/index.js:67:7
 orderDetailsModel.belongsTo(rentalItemModel);
 
 eventModel.belongsToMany(categoryModel, {
-  as: 'categories',
+  as: "",
   through: 'EventsCategory',
 });

[Timeout] StringLiteral
src/models/index.js:68:12
 
 eventModel.belongsToMany(categoryModel, {
   as: 'categories',
-  through: 'EventsCategory',
+  through: "",
 });
 

[Timeout] StringLiteral
src/models/index.js:72:7
 });
 
 categoryModel.belongsToMany(eventModel, {
-  as: 'events',
+  as: "",
   through: 'EventsCategory',
 });

[Timeout] StringLiteral
src/models/index.js:73:12
 
 categoryModel.belongsToMany(eventModel, {
   as: 'events',
-  through: 'EventsCategory',
+  through: "",
 });
 

[Timeout] StringLiteral
src/models/index.js:80:49
 eventModel.hasMany(eventCategorYModel, { as: 'EventsCategory' });
 eventCategorYModel.belongsTo(eventModel);
 
-categoryModel.hasMany(eventCategorYModel, { as: 'EventsCategory' });
+categoryModel.hasMany(eventCategorYModel, { as: "" });
 eventCategorYModel.belongsTo(categoryModel);
 

[Killed] ObjectLiteral
src/models/index.js:108:18
 
 
 
-module.exports = {
-  sequelize,
-  userCollection,
-  authCollection,
-  rentalItemsCollection,
-  saleItemCollection,
-  storeCollection,
-  orderCollection,
-  orderDetailsCollection,
-  rentalTrackerCollection,
-  eventCollection,
-  categoryCollection,
-  testCollection,
-  eventCatCollection
-};
+module.exports = {};
 
killedBy: Categories Routes should create and delete an category 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
