[Timeout] ObjectLiteral
src/models/schemas/event.model.js:7:38
 const createEventModel = (sequelize, DataTypes) => {
 
 
-    return sequelize.define('Event', {
-        eventType: {
-            type: DataTypes.STRING,
-            allowNull: false,
-            unique: true
-        },
-        eventImgPath: {
-            type: DataTypes.TEXT
-        },
-        eventImgName: {
-            type: DataTypes.STRING
-        }
-    });
+    return sequelize.define('Event', {});
 
 

[Timeout] BooleanLiteral
src/models/schemas/event.model.js:11:21
         eventType: {
             type: DataTypes.STRING,
             allowNull: false,
-            unique: true
+            unique: false
         },
         eventImgPath: {
