[Timeout] BooleanLiteral
src/models/schemas/eventsCategorie.model.js:12:28
         id: {
             type: DataTypes.INTEGER,
             primaryKey: true,
-            autoIncrement: true,
+            autoIncrement: false,
             allowNull: false
         }

[Timeout] BooleanLiteral
src/models/schemas/eventsCategorie.model.js:13:24
             type: DataTypes.INTEGER,
             primaryKey: true,
             autoIncrement: true,
-            allowNull: false
+            allowNull: true
         }
     });
