[Timeout] ObjectLiteral
src/models/schemas/itemRental.model.js:7:14
     imgPath: {
         type: DataTypes.TEXT
     },
-    imgName: {
-        type: DataTypes.STRING
-    },
+    imgName: {},
     name: {
         type: DataTypes.STRING,

[Timeout] BooleanLiteral
src/models/schemas/itemRental.model.js:12:20
     },
     name: {
         type: DataTypes.STRING,
-        allowNull: false
+        allowNull: true
     },
     quantity: {

[Timeout] ObjectLiteral
src/models/schemas/itemRental.model.js:17:19
     quantity: {
         type: DataTypes.INTEGER,
         allowNull: false,
-        validate: {
-            min: 0
-        }
+        validate: {}
     },
     price: {

[Timeout] BooleanLiteral
src/models/schemas/itemRental.model.js:23:20
     },
     price: {
         type: DataTypes.INTEGER,
-        allowNull: false
+        allowNull: true
     }
 })
