[Timeout] StringLiteral
src/models/schemas/itemSale.model.js:3:72
 'use strict';
 
-const createItemSaleModel = (sequelize, DataTypes) => sequelize.define('SaleItem', {
+const createItemSaleModel = (sequelize, DataTypes) => sequelize.define("", {
     imgPath: {
         type: DataTypes.TEXT

[Timeout] ObjectLiteral
src/models/schemas/itemSale.model.js:3:84
 'use strict';
 
-const createItemSaleModel = (sequelize, DataTypes) => sequelize.define('SaleItem', {
-    imgPath: {
-        type: DataTypes.TEXT
-    },
-    imgName: {
-        type: DataTypes.STRING
-    },
-    name: {
-        type: DataTypes.STRING,
-        allowNull: false
-    },
-    quantity: {
-        type: DataTypes.INTEGER,
-        allowNull: false,
-        validate: {
-            min: 0
-        }
-    },
-    price: {
-        type: DataTypes.INTEGER,
-        allowNull: false
-    }
-})
+const createItemSaleModel = (sequelize, DataTypes) => sequelize.define('SaleItem', {})
 module.exports = createItemSaleModel;
 
