[Timeout] StringLiteral
src/models/schemas/order.model.js:3:69
 'use strict';
 
-const createOrderModel = (sequelize, DataTypes) => sequelize.define('Order', {
+const createOrderModel = (sequelize, DataTypes) => sequelize.define("", {
     orderDate: {
         type: DataTypes.DATE,

[Timeout] BooleanLiteral
src/models/schemas/order.model.js:6:20
 const createOrderModel = (sequelize, DataTypes) => sequelize.define('Order', {
     orderDate: {
         type: DataTypes.DATE,
-        allowNull: false
+        allowNull: true
     },
     deleveryDate: {

[Killed] BooleanLiteral
src/models/schemas/order.model.js:13:45
         allowNull: false
     },
     totalPrice: {
-        type: DataTypes.INTEGER, allowNull: false
+        type: DataTypes.INTEGER, allowNull: true
     }
 })
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
