[Timeout] ObjectLiteral
src/models/schemas/store.model.js:5:16
 
 const createStoreModel = (sequelize, DataTypes) => {
   return sequelize.define("Store", {
-    storeName: {
-      type: DataTypes.STRING,
-      allowNull: false,
-    },
+    storeName: {},
     logoPath: {
       type: DataTypes.TEXT

[Killed] StringLiteral
src/models/schemas/store.model.js:18:9
     address: {
       type: DataTypes.ENUM(
         'irbid',
-        'mafraq',
+        "",
         'jerash',
         'ajloun',
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] StringLiteral
src/models/schemas/store.model.js:19:9
       type: DataTypes.ENUM(
         'irbid',
         'mafraq',
-        'jerash',
+        "",
         'ajloun',
         'amman',

[Timeout] StringLiteral
src/models/schemas/store.model.js:21:9
         'mafraq',
         'jerash',
         'ajloun',
-        'amman',
+        "",
         'zarqa',
         'balqa',

[Timeout] StringLiteral
src/models/schemas/store.model.js:25:9
         'zarqa',
         'balqa',
         'madaba',
-        'karak',
+        "",
         'aqaba',
         'maan',

[Timeout] StringLiteral
src/models/schemas/store.model.js:27:9
         'madaba',
         'karak',
         'aqaba',
-        'maan',
+        "",
         'tafilah'
       ),

[Killed] StringLiteral
src/models/schemas/store.model.js:30:21
         'maan',
         'tafilah'
       ),
-      defaultValue: 'amman',
+      defaultValue: "",
       allowNull: false,
     },
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BooleanLiteral
src/models/schemas/store.model.js:31:18
         'tafilah'
       ),
       defaultValue: 'amman',
-      allowNull: false,
+      allowNull: true,
     },
     phone: {
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
