[Timeout] StringLiteral
src/models/schemas/user.model.js:4:20
 'use strict';
 
 const createUsertModel = (sequelize, DataTypes) =>
-  sequelize.define('User', {
+  sequelize.define("", {
     username: {
       type: DataTypes.STRING,

[Timeout] StringLiteral
src/models/schemas/user.model.js:10:28
       allowNull: false,
     },
     role: {
-      type: DataTypes.ENUM('admin', 'client', 'provider'),
+      type: DataTypes.ENUM("", 'client', 'provider'),
       defaultValue: 'client',
       allowNull: false

[Timeout] StringLiteral
src/models/schemas/user.model.js:10:37
       allowNull: false,
     },
     role: {
-      type: DataTypes.ENUM('admin', 'client', 'provider'),
+      type: DataTypes.ENUM('admin', "", 'provider'),
       defaultValue: 'client',
       allowNull: false

[Timeout] BooleanLiteral
src/models/schemas/user.model.js:12:18
     role: {
       type: DataTypes.ENUM('admin', 'client', 'provider'),
       defaultValue: 'client',
-      allowNull: false
+      allowNull: true
     },
     address: {

[Killed] StringLiteral
src/models/schemas/user.model.js:21:9
         'jerash',
         'ajloun',
         'amman',
-        'zarqa',
+        "",
         'balqa',
         'madaba',
killedBy: Events Routes should create  a new event 
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Timeout] StringLiteral
src/models/schemas/user.model.js:25:9
         'balqa',
         'madaba',
         'karak',
-        'aqaba',
+        "",
         'maan',
         'tafilah'

[Timeout] BooleanLiteral
src/models/schemas/user.model.js:52:18
       allowNull: false,
       unique: true,
       validate: {
-        isEmail: true,
+        isEmail: false,
       },
     },
